{"title":"开辟新战场，打造新的商业模式","slug":"create-new-business-model","date":"2016-04-13T15:49:00.000Z","updated":"2017-11-05T08:31:10.000Z","comments":true,"path":"api/articles/create-new-business-model.json","excerpt":null,"covers":["http://upload-images.jianshu.io/upload_images/264714-4312a9c7f9a53c74.jpg?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240"],"content":"<p><img src=\"http://upload-images.jianshu.io/upload_images/264714-4312a9c7f9a53c74.jpg?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240\" alt=\"战场\"></p>\n<p>在当今商业竞争异常激烈的年代，“差异化”和“革新”这两个词被广泛的交替使用，人们对它们之间的差别已经变得越来越模糊。比如我们经常会听到人说，我们要革新我们的商业模式，对我们的产品重新进行定位，找到有差异化的新商业模式和产品定位。</p>\n<p>其实它们之间是有着明显的区别的，“差异化”形容的是当前事物和旧事物还是基于同样的基础架构的，只是上层的表现形式等发生了改变。比如无论你一辆车的形状怎么变，无论你是烧汽油的兰博基尼还是使用电力的特斯拉，最终它还是一辆车。“革新”指的是用新的事物替代掉老的事物，比如原来的交通工具是马，而后来被汽车所替代，这就是革新。</p>\n<p>每个公司都存在着商业模式，就算是搞走私的开青楼的也都毫不例外。但很少有公司能开辟出一个新的商业模式。相比东莞的青楼，珠海莲花路新开的青楼的商业模式并不多大差别，价值主张还是那个价值主张，分销渠道和成本结构等也并无二致，只是可能东莞那边定位的是为广大打工一族解决生理需要，而这边定位的是解决日本人出差寂寞的需要(不明白我说什么的大可百度”日本人 珠海“想必多年前那新闻还能在搜索结果的首页中出现)。</p>\n<p>在智能手机界，通过调整定位来改变商业模式的例子我们屡见不鲜。比如老罗个锤子开始的定位是去sale情怀，自从进入千元机市场后，过去的情怀就有如我们80后脸上曾经的青春痘一样，一去不复返了。</p>\n<p>这种定位的调整，打的牌无非还是价格的差异化，功能的差异化，和用户定位的差异化。</p>\n<p>相比，淘宝的出现却是一个革命性的创新。一开始大家大家开个实体店，比的无非是谁的位置好，谁的装潢更豪华，谁家的销售妹妹更漂亮更吸引顾客。当淘宝出现后，一切都变了。你不再需要因为店面不在闹市而愁，面对面的服务也没有了。淘宝为什么能做到这一点呢？因为在传统实体店铺还在“差异化”这个战场打得你死我活的时候，淘宝已经高瞻远瞩的开辟了一片广袤的新战场，并制定了一套革新的战争规则。</p>\n<p>一个新的商业模式需要对老的商业模式进行颠覆，所以你必须要对老的商业模式了如指掌。我提出这一点的原因是很多企业的高管其实并不清楚公司的商业模式，甚至从来没有想过这个事情，只是在拿着一份工资而已。你需要搞清楚公司所以能获得今天的成就的战略性因素，撇开这些去谈商业模式的创新都是瞎扯淡耍流氓。</p>\n<p>然后，你需要进入到你的顾客的心智，搞清楚这些战略性因素在他们的心中是如何定义和看待的。听听他们的故事，很有可能他们就会在言语间告诉你那个梦寐以求的颠覆性的商业模式将会是什么样子的。</p>\n<p>切记不要在公司内部关上门去寻找什么商业模式的创新，这种做法其实只是一个老掉牙的商业流程再造工程而已。很多大点的有官僚主义风格的企业都喜欢搞这套，动不动就开个会，一拍板就关上门搞创新。其实这种由内而外的做法只会让你闭门造车，如盲目将自己的产品加个新模块，提高下价格就以为自己成了高端产品，找到了新的商业模式。</p>\n<p>我们更应该由外而内的对我们的商业模式进行思考，关注我们的客户，而不是先去关注我们内部应该如何调整。一旦我们通过客户发现了新的商业模式之后，我们内部需要怎样的变革也自然而然的会发生了。</p>\n<p>最后，我们就可以对这些导致我们得以成功的战略因素一个个进行拷问。以购物商店为例，关键的战略因素无非就是商店所处地段的人气，附近银行是否便利，排队时间是否过长，营业时间等。那么我们就需要多问几个如果：如果顾客不需要亲自来到商店会怎样？如果根本不需要有实体商店的存在会怎样？如果不需要排队会怎样？如果不再需要限定营业时间会怎样…。一直追问下去，你就会发觉一个网店的概念就出来了。</p>\n<p>其实上面提到的这些问题都是顾客的痛点，很多顾客早就想过这些问题了，只是他们不知道如何去进行改变而已。所以只要你能找到一个进入他们脑海的方法，了解清楚他们是如何思考的，相信找到一个新的商业模式并不是天荒夜谭的事情。</p>\n<p>我们看到很多公司的高层都在针对他们当前商业模式的战略因素定位进行不断的提炼，提炼，再提炼，目的仅仅就是为了挤出比竞争对手多那么一点点差异化的优势。这里我并不是完全去否定这种做法，但要注意的是，你这样做的同时，你的竞争对手一样也会这样做，你们还是在同一个战场上进行较量。</p>\n<p>我的建议是，你最好能像上面提及的那样找出一个新的商业模式，开辟属于你自己的新战场。过程中你也许需要冲破一些行业准则，但哪个颠覆性的创新不是这样子的呢?</p>\n<p><span style=\"color: #999999;\">注：更多文章请关注公众号:techgogogo或个人博客<a href=\"http://techgogogo.com/\" target=\"_blank\" rel=\"noopener\">http://techgogogo.com</a>。当然，也非常欢迎您直接微信(zhubaitian1)勾搭</span></p>\n","categories":[{"name":"创业","path":"api/categories/创业.json"}],"tags":[]}