{"title":"创业教父Paul Graham: 穷途末路还是康庄大道","slug":"defalt-alive-or-default-dead","date":"2015-10-17T01:06:11.000Z","updated":"2017-07-16T15:52:19.000Z","comments":true,"path":"api/articles/defalt-alive-or-default-dead.json","excerpt":null,"covers":["http://upload-images.jianshu.io/upload_images/264714-d74c1e467b0d4a4a.jpg?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240","http://upload-images.jianshu.io/upload_images/264714-3b2ff6fda6e5724f.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240"],"content":"<p><a href=\"http://upload-images.jianshu.io/upload_images/264714-d74c1e467b0d4a4a.jpg?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240\" target=\"_blank\" rel=\"noopener\"><img src=\"http://upload-images.jianshu.io/upload_images/264714-d74c1e467b0d4a4a.jpg?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240\" alt=\"Power Through\"></a></p>\n<p>当我和那些运作了有8、9个月的初创企业交谈的时候，我通常毫无例外的都会问它们同一个问题。在假设它们的支出固定以及他们的增长率就如最近几个月一样不会改变的情况下，它们是否可以凭借当前仅剩的资金来达到最终可盈利的目的？或者换一个更戏剧化的说法：如果继续这样走下去的话，它们是注定要走向死亡还是能够持续生存？</p>\n<p>令人吃惊的是初创企业的创始人们常常不知道自己所处的状况。有一半跟我交谈过的创始人都对自己的企业是否正在走向穷途末路还是能够最终持续生存没有什么概念。</p>\n<p>如果你也是其中一员的话，那么你最好先用Trevor Blackwell的这个<a href=\"http://growth.tlb.org/#\" target=\"_blank\" rel=\"noopener\">计算器</a>来给自己的初创企业先算算命。</p>\n<p><a href=\"http://upload-images.jianshu.io/upload_images/264714-3b2ff6fda6e5724f.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240\" target=\"_blank\" rel=\"noopener\"><img src=\"http://upload-images.jianshu.io/upload_images/264714-3b2ff6fda6e5724f.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240\" alt=\"RevenueGrowth Calculator\"></a></p>\n<p>我之所以首先会问这些初创企业这个问题的原因，是因为往后的对话都是建立在他们的答案之上的。如果你的企业是可以继续生存的，我们就能够往下继续谈谈他们该如何大胆的创新开拓。如果继续这样走下去，你的企业是注定走向死亡的，我们可能就需要看看是否还有可以挽回的一线生机。我们了解到了当前的道路走下去的结果终究是个死胡同，那么我们就要想办法看看是否能换条路走走。</p>\n<p>为什么有这么多的创始人不清楚他们正在走向灭亡还是能够最终持续生存呢？我想主要的原因就是他们不习惯问自己这样的问题。一个初创企业过早的问自己这个问题显得根本毫无意思，这就好比问一个3岁大的小毛孩该如何自立以养活自己一样。但是随着初创企业逐渐成长，这个问题就会从毫无意思转变成生死攸关。而这种转变出现时通常都会把你吓一大跳。</p>\n<p>所以我给大家的建议是：与其问的太晚，不如早点问自己究竟你的企业这样走下去是注定死亡还是会走向康庄大道。尽管我们很难说究竟这个问题什么时候会从毫无意思转变成生死攸关，但是古语有云，生于忧患死于安乐，早点担心自己是否正在走向灭亡，总比你临死回眸来得安全。</p>\n<p>我在早期写的文章表述过“<a href=\"http://www.paulgraham.com/pinch.html\" target=\"_blank\" rel=\"noopener\">致命拮据</a>“(fatal pinch)这个现象。致命拮据等同于注定死亡+慢速增长+没时间拯救。而创始人所以陷入进去的原因就是他们根本没有意识到自己正在走向死亡。</p>\n<p>创始人没有审视自己究竟正在走向死亡还是能够继续生存的另外一个原因是：他们以为自己可以很容易的进行融资。但事实往往却是相反的，更糟糕的是，他们越是依赖于这种想法。他们就错得越离谱。</p>\n<p>也许大家是时候分清楚什么是现实什么是幻想。与其沉浸在对未来模糊的乐观上，不如现实点，明确的把解救方法给列出来。比如“我们正在默默走向死亡，但是我们依赖投资人来拯救我们。” 也许你会像我一样，立刻因此而在脑海敲响另外一次警钟。但是如果你能尽早的警觉的话，你也许就能避开“致命拮据”。</p>\n<p>如果有投资人打救的话，你当前的道路就算是个死胡同可能也不至于身陷绝境。但是别忘记风投的规则就是，VC关注的只是你的增长。如果你的增长率上行陡峭，比如达到每年6陪的增长率，那么就算你现在没有任何盈利，你依然可以开始相信投资人来对打救你。</p>\n<p>但是投资人事非常善变的，你所能做的事情也仅仅是“开始”相信他们会打救你而已。有时你的企业出现的一些情况可能很容易就会将这些投资人给吓跑，这时即使你有着相当不错的增长率也会无济于事。所以，无论你的增长率有多好，仅仅将引进融资作为你的多个计划中的Plan A从来就不失为一个安全的考虑。你应该常常有着个Plan B来旁身：你应该精确的知道，当你不能融到任何资金的时候，你该如何做才能继续生存下去。同时，你还需要非常果断的在当Plan A行不通的时候立刻切换到Plan B上来。</p>\n<p>无论如何，快速增长和低廉的支出在很多创始人眼里都是一分为二、水火不容的。事实上令人惊讶的是，实际上一个初创企业的花销和其增长速度是几乎没有多少关系的。当一个初创企业快速增长，通常的原因是它的产品戳中用户的痛点，直接命中了一个巨大的需求。当一个初创企业支出庞大的时候，往往是因为他们的产品的开发和销售支出过于巨大，或者说它们本身就是一种浪费。</p>\n<p>如果你有专心看这篇文章的话，这个时候你应该不仅会问我该如何才能避免“致命拮据”，还会寻思该如何才能避免注定死亡。其实答案很简单：别急于扩招。招聘过快是迄今为止获得融资后的初创企业的最大的杀手。</p>\n<p>创始人常常告诉自己必须要进行招兵买马才能拉高增长率。但这往往更多是因为创始人错误的对扩招进行了高估。为什么呢？一部分原因是因为事太多了，天真的创始人就会立马想到如果能增加更多的人手就最好了；另外一部分原因是因为其他的成功初创企业都有着大量的员工，所以创始人认为人多力量大，要有足够的兵力才能获得更大的成功。而事实上，那些成功的初创企业有着大量的员工，往往是成功的结果，而非成功的原因；还有一部分原因是因为企业增长速度缓慢，而这些创始人却不愿意面对这样的一个事实：你的产品没有足够的吸引力！</p>\n<p>另外，刚刚获得融资的创始人通常会受到给他们投资的VC们的怂恿而进行过度的扩招。因为投资组合效应(根据幂次法则，只要所投资的一个企业获得巨大成功，VC们就能赚得盘满钵满)，所以他们对单个投资企业的策略往往是孤注一掷。所以无论VC们说得如何天花乱坠，他们目的就是想要把你吹得很大(然后可以在适当时候退出以赚钱)。但是你自己作为创始人，动机却完全不一样，你想要的终究还是自己的企业的持续生存。</p>\n<p>以下就是一个初创企业迈向死亡常见的原因。它们的产品吸引力一般，且增长率平平。它们很容易就获得了第一轮的融资，因为开始时它们的创始人开上去非常聪明，且这个创意听上去也值得鼓掌。但因为这个产品吸引力和增长率都是中规中矩而已，并没有达到异乎寻常的程度。创始人就会尝试说服自己只要招聘更多的人进来就能够将增长率给提升了。而他们的投资人也对此首肯。但事实上是这个增长率一直没有提升上去(因为你的产品仅仅是中规中矩而已)。这样的话这些企业很快就开始偏离跑道了。它们这时会希望引进更多的投资来拯救他们。但是因为它们现在的耗费巨大，且增长也乏力，它们再也不是投资人眼里的香馍馍了。结果就是它们没法引入进一轮的融资，最终以关门大吉告终。</p>\n<p>这些初创企业本来应该尽早做的事情就是去定位出这个根本性的问题：那就是你的产品的吸引力平平。去招聘新人往往并不是解决这个问题的办法，相反，这很有可能还会让事情变得更糟糕。在这个早期阶段，这个产品更需要的是进化而不是“扩建”，而要做到这一点的话，通常几个关键的人做起来会比起你一大帮人一拥而上来得更容易。</p>\n<p>不时的问自己你的企业现在是在默默走向死亡还是能够持续生存，这也许会让你避开这些悲剧发生在你身上，在你尝试进行过度扩招时敲响警钟。这样你就会先尝试强迫自己去寻求其他提升增长率的方式。比如<a href=\"http://www.paulgraham.com/ds.html\" target=\"_blank\" rel=\"noopener\">做一些非规模化的事情</a>，或者对产品进行只有创始人才能做到的重新设计。事实上，对绝大多数的初创企业来说，这些方式对它们才是真正有效的。</p>\n<p>Airbnb在融资之后就是等了4个月才开始招进第一个新员工的。此前，创始人都是过度劳苦的进行拼命工作。但，它们的劳苦最终却成就了Airbnb风光无限的今天。</p>\n<p>&nbsp;</p>\n<hr>\n<p><span style=\"color: #999999;\"><em>注：更多文章请关注公众号:techgogogo或个人博客<a href=\"http://techgogogo.com/\" target=\"_blank\" rel=\"noopener\">http://techgogogo.com</a>。当然，也非常欢迎您直接微信(zhubaitian1)勾搭。本文英文版来自创业教父Paul Graham的个人博客文章《<a href=\"http://www.paulgraham.com/aord.html\" target=\"_blank\" rel=\"noopener\">Default Dead or Default Alive</a>》，中文版由天地会珠海分舵进行编译。本文首发本人iDoNews专栏。</em></span></p>\n","categories":[{"name":"创业","path":"api/categories/创业.json"}],"tags":[]}