{"title":"全栈工程师？给把瑞士军刀你去砍鬼子好不好！？","slug":"full_stack_or_mr_know_it_all","date":"2015-06-16T00:06:53.000Z","updated":"2017-07-17T03:55:39.000Z","comments":true,"path":"api/articles/full_stack_or_mr_know_it_all.json","excerpt":null,"covers":null,"content":"<blockquote>\n<p><span style=\"color: #999999;\"><em>编者注：本文来自<a href=\"https://medium.com/re-write/we-dont-need-more-designers-who-can-code-b81483d2a0e6\" target=\"_blank\" rel=\"noopener\">Medium</a>前三名推荐文章，发文时已经获得高达2,125个推荐，中文版由天地会珠海分舵编译。全文对当今风靡业界的“全栈xx师“的说法给以抨击，提出了自己独到的观点。人家庖丁解牛时候就没有听说过用的是瑞士军刀；古人杀鸡的时候也焉用牛刀；一个专业的刀客，用的绝对不是周星驰的那把杀猪刀…</em></span></p>\n</blockquote>\n<p>现在到处都在提出说自己公司诚招一个全栈xx师，比如，“诚聘若干可以进行编码的全棧设计师“。如果你现在去Google下“一个设计师是否应该学习编程(<span style=\"color: #999999;\"><em>天地会珠海分舵注：编译的时候请换成英文：”should designers learn to code”</em></span>)“，谷歌轻轻松松就能给你返回2500万条结果。</p>\n<p>坦白说，其实我并不反对一个设计师拥有编码的能力。但是，我认为现在这种炙手可热但人云亦云的这种说法存在问题，“我们需要可以进行编码的全棧设计师/我们需要精通设计的全栈开发工程师“， 因为这个论调隐藏着一些潜在的严重问题。</p>\n<p>如果作为一个产品设计团队的老大，你又可以进行代码编写（前台和后台）的话，我非常清楚这种技能组合是非常抢眼的。产品原型设计的能力，将设计原型通过代码实现出来的交叉学科能力，可以将最终的实现进行调优并作为成品推向市场的能力，梦寐以求啊！。</p>\n<p>但是，作为一个设计师，我非常清楚这里的边界应该在哪里，我不是开发工程师，我不会期望自己写出成品级别，真正能推出市场进行量产的产品的代码。</p>\n<p>现在这种硬性要求设计师必须要有编码能力的说法，给人的一个感觉就是设计团队和开发团队本来就应该是融为一体，团队中每个成员都是设计师和程序员的合体的感觉，一个所谓的全栈互联网怪兽。</p>\n<p>大哥，我们还是现实点吧。设计和开发(包括前端和后台)都是非常专业的职业，每一个都是需要多年无数个小时的学习，需要多少年的锤炼浸淫才能掌握好的。你现在却动不动就想要公开招聘一个设计高手和开发高手合体的全才，你这不是在做白日梦是什么。</p>\n<p><strong>其实这才是我们真正需要的</strong>：一个可以设计出精美绝伦的产品的设计师，以及一个可以开发出无与伦比的产品的开发人员，且这两人能够无间合作。</p>\n<p>那么怎么才能达成呢，这就需要一个关键的因素：同理心(empathy)。</p>\n<p>所以这里我们更应该表达的意思是：我们需要招聘一个可以理解代码的设计师，或者，我们需要招聘一个可以理解设计的软件开发工程师。</p>\n<p>至于设计师需要理解代码的这个原因，跟开发工程师需要理解设计的原因是一样的。并不是说需要一个工程师变成设计师，而是需要这个软件工程师拥有能理解设计师的同理心。能够用设计师的语言跟设计师打交道，来对为什么设计师要如此设计的良苦用心有清晰的理解。</p>\n<p>而这也是我们冲破信息孤岛很重要的一个方法，打开设计师和开发工程师之间的话匣子，无间的进行合作沟通，这样才能做出伟大的产品。但，千万不要硬性要求他们都去掌握对方的全部技术，否则他们很有可能在自己的专业上都成为不了专家。</p>\n<p>当一个人说他们公司需要的是“若干可以编码的设计师”的时候，我脑海中想到的是他们需要的不是设计师，需要的是一把瑞士军刀，集合螺丝刀，剪刀，小刀，牙签，锯子功能的那么一把“刀”。</p>\n<p>但，问题是瑞士军刀看上去什么功能都有，但是真要派到专业用场上的话却没有一样行。你看过一个工匠拿着个瑞士军刀来给你家的房子上螺丝锯木头做木工的吗？你又是否有看到一个裁缝拿着把瑞士军刀给你做衣服？或者你又是否看到一个大厨在把弄着个瑞士军刀来跟你切菜砍肉？</p>\n<p>人家古惑仔都知道拿个弹簧刀西瓜刀什么的出来闯江湖，而你却要搞个瑞士军刀来打天下？所以说，瑞士军刀只能在一些很基本的场合可以派上用场，但是万万不能不能在大场面上将它拿出来替代掉专业的器材，不然会事倍功半，笑掉人大牙。也许偶尔拿出来充下场面还可以。</p>\n<p>更糟糕的是，正因为它什么都想做，导致我们都很难将之定义为一把“刀”了。你看，这不搞得成了个四不像吗？</p>\n<p>人家庖丁解牛时候就没有听说过用的是瑞士军刀；古人杀鸡的时候也焉用牛刀；一个专业的刀客，用的绝对不是周星驰的那把杀猪刀(一笑)。</p>\n<p>所以说，工欲善其事，必先利其器。同理，专业的团队必然对自己的拿手武器有着特别的专长。</p>\n<p>我就不希望我公司里面的那些设计师们消耗大量的时间去学习最新的跨浏览器CSS解决方案，或者去挠破脑袋学习javascript的闭包究竟是TMD的怎么一回事。反之亦然，我也不会希望我的开发工程师们会花时间研究设计技术中的颜色理论是怎么一回事。</p>\n<p>我希望我的设计师能花更多的时间去跟上最新的移动接口设计标准，以及学习最新的设计实践技巧。我需要他们去花时间学习我们的用户对设计的喜好，去挖掘哪些我们设计上还没有满足的那部分用户。我需要他们关注在那些在设计上可以让我们的产品做到最好的事情上面。当然，当中需要学习的一小部分就是去学习对代码进行理解，这样他们才能更高效的，更有同理心的和开发团队打成一片，共同成就一个伟大的产品团队。</p>\n<p>所以，现在外界所街知巷闻的要求招聘到可以像程序员一样编写代码的全棧设计师，其实说穿了只会把事情弄得越来越糟糕。其实这些人的脑袋是被驴踢了，不知道正是因为开发人员不是一个和专业设计师合体的人，他才能真正从用户的角度出发来审视设计师们搞出来的设计是否真的是用户想要的。而对于设计师，他应该能对他的设计将会如何的被开发人员进行实现有所了解，如果还能自己编码弄出个原型的话，奖赏，午饭加个鸡腿！但是，我们要从内心里放弃要求设计师必须也是一个程序员的这种观念(以及给以设计师的压力)，同理，也不能非要将一个开发工程师变成开发和设计合体的超人。</p>\n<p>能分身面面俱到样样精通的人应该有，但起码我没有在现实见到过。《西游记》上倒是有看到过，但人家不是人，人家是猴子，叫孙猴子！</p>\n<p>如果你能让你的团队成员们各自专注在自己所长的领域，同时又对合作团队的领域有所理解以获得足够的同理心的话，这样你就不需要再抱着打造一把瑞士军刀的想法了。相反，你已经拥有了一帮有着各自的必杀技而又能通力合作的团队，这还不够你所向披靡的吗？</p>\n<hr>\n<p><span style=\"color: #999999;\"><em>编者注：__更多文章请关注公众号:<strong>techgogogo</strong>或官网<a href=\"http://techgogogo.com/\" target=\"_blank\" rel=\"noopener\">www.techgogogo.com</a>。当然，也非常欢迎您直接微信(<strong>zhubaitian1</strong>)勾搭。</em></span></p>\n<p><span style=\"color: #999999;\"><em>本作品采用[<a href=\"http://creativecommons.org/licenses/by/3.0/cn/\" target=\"_blank\" rel=\"noopener\">创作共用署名3.0中国大陆版许可证</a>], 欢迎转载，转载时敬请保留公众号等信息。</em></span></p>\n","categories":[{"name":"创业","path":"api/categories/创业.json"}],"tags":[]}