{"title":"正确的三个交棒姿势将决定你是否能赢得创新这场接力赛","slug":"relay_raise_and_creative","date":"2015-07-09T23:59:05.000Z","updated":"2017-07-17T03:02:05.000Z","comments":true,"path":"api/articles/relay_raise_and_creative.json","excerpt":null,"covers":["http://upload-images.jianshu.io/upload_images/264714-70bc93d88ec3500e.jpg?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240/q/100"],"content":"<p><a href=\"http://upload-images.jianshu.io/upload_images/264714-70bc93d88ec3500e.jpg?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240/q/100\" target=\"_blank\" rel=\"noopener\"><img src=\"http://upload-images.jianshu.io/upload_images/264714-70bc93d88ec3500e.jpg?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240/q/100\" alt=\"drop-baton\"></a></p>\n<p>&nbsp;</p>\n<p><span style=\"color: #999999;\"><em>编者注：本文由号称“创新院长”的Jeff DeGraff<a href=\"https://www.linkedin.com/pulse/how-win-innovation-race-jeff-degraff\" target=\"_blank\" rel=\"noopener\">发表在LinkedIn</a>上，中文版由天地会珠海分舵进行编译。</em></span></p>\n<p>&nbsp;</p>\n<h3 id=\"创新是场接力赛\"><a href=\"#创新是场接力赛\" class=\"headerlink\" title=\"创新是场接力赛\"></a><span style=\"color: #993300;\">创新是场接力赛</span></h3><hr>\n<p>与其说创新是一场旷日持久的马拉松或者是一场以速度制胜的短跑，倒不如说创新是一场团体的接力赛：每个阶段之间的交棒时刻才是从这场赛跑胜出的关键所在。你其中的一个阶段能快如闪电的完成，并不一定最终就能赢取这场接力赛。</p>\n<p>只有在整个过程中你的每次交棒都能顺利高效完成的时候，你团队中的飞毛腿才有可能在这场赛跑中，发挥真正对赢得比赛有价值的效用。</p>\n<p>如何将这些不同的交棒阶段磨练好以及管理好，将是一个创新项目从开始到最终获得成功的关键。我们看过太多的创意，因为该创意的产生者不能顺利的将其交接到下一个开发环节而难产甚至胎死腹中。</p>\n<p>这里的挑战主要就是几个关键环节的”交棒“阶段 – 比如，从创意概念到做出产品的“交棒”；从本地部署到全球部署阶段的“交棒”。你也许一开始的时候就有着一个杀手级的创意，以及该如何将这创意执行实现出来的看似无懈可击的策略，但是，如果你不能在你的产品或者服务需要进行扩张和商品化的时候高效的进行“交棒”的话，那么你将很有可能会输掉这场创新接力赛。</p>\n<p>&nbsp;</p>\n<h3 id=\"创新接力赛的三个赛段\"><a href=\"#创新接力赛的三个赛段\" class=\"headerlink\" title=\"创新接力赛的三个赛段\"></a><span style=\"color: #993300;\">创新接力赛的三个赛段</span></h3><hr>\n<p>创新这场接力赛主要包含三个关键赛段，每个赛段的交棒点都有着与众不同的难点。</p>\n<p>这里的第一个阶段我们姑且称为“创新第一棒“。这是早期的一个头脑风暴满天飞的时期，一帮创满创意的家伙聚在一块进行创意碰撞，并对这些创意进行快速的验证。里面充满了各种各样的观点，碰撞，不停的尝试看哪些是可行的而哪些又是不可行的。这些在“创新第一棒”中的激进空想主义者常常在将其创意交棒到第二阶段(将创意变成产品的阶段)的时候不小心把接力棒掉地上去。这主要是关于该创意的不同的想法和观点太多，而在初始阶段又没有足够的资源和碰撞。结果就导致了，“第一棒”的思考家们的创意没有正确的交接到第二阶段而胎死腹中。</p>\n<p>下一个赛段就是中场阶段，就是一帮人将一个创新变得可行或者可工作的时候。这个阶段涉及到如何打造出正确的策略，如何招聘到正确的人员，以及如何将产品或者服务卖出去。这就牵涉到招聘，员工安置，销售，和市场。问题是这是整个创新接力赛中最长的一个赛段，所以创新的动量就很容易在这漫长的过程中消磨掉。这个赛段同时也是两组截然不同的类型的人员必须和谐共处通力合作的阶段：一帮是高度专注的事业心爆棚的追求利润的成员，而另外一帮是擅长精耕细作，进行协作，有着社区思维的成员。如果这两种力量不能学会如何一起协同工作的话，那么这个创新项目也就陷入僵局了。</p>\n<p>最后一个阶段就是冲刺阶段，这个阶段中组织开始对创新结果进行运作和扩张。在这个时间段你需要做的事情就是进行大量新产品的生产，或者是将你的服务推广到世界任何一个角落。在这个阶段，所有环节都需要同步有序的进行。这就需要涉及到流程的提升，技术的增强，以及供应链的协调。做这些事情的目的就是为了让整个系统更稳定，质量更好，效率更高。接手冲刺这一棒的人不但要技术功底深厚还必须要善于分析。为了建立这种可控的标准，这个阶段往往就会牺牲掉创新的速度和量级。所以某种程度上，相当于是把创新的元素从这个创新的过程中给剔除掉。也就是说这个阶段把创新拖得过慢，终将会让我们太晚到达创新的终点，而其他竞争者则早到达终点开始享受创新的果实。</p>\n<p>&nbsp;</p>\n<h3 id=\"接棒的三个正确姿势\"><a href=\"#接棒的三个正确姿势\" class=\"headerlink\" title=\"接棒的三个正确姿势\"></a><span style=\"color: #993300;\">接棒的三个正确姿势</span></h3><hr>\n<p>那么我们怎样才能既跑得快又跑得稳呢？如何才能顺利高效的进行交棒呢？下面就是对这些创新中的关键阶段进行管理的三个策略。</p>\n<p><strong>超前的眼光</strong>：将下个赛段的一些人员安排到前一个赛段上面来，让他们清楚的知道今后进行交棒的时候需要注意一些什么样的事情，如何才能高效的接过上一赛段的同侪交过来的接力棒。让激进的思想家和发明家跟市场专家紧密的进行沟通。如果你的创新产品是一个软件应用，你就需要在你的团队中安排一些非IT专家类型但对客户非常了解的成员，这样你才能打造出一个客户大众认可的产品。同样，在完成交棒之后，需要安排前一赛段的人员到下一赛段上面去，以确保创新不会退化。确保设计出这个创新的人会跟进整个创新过程，以确保创新的愿景不会变质。</p>\n<p><strong>翻译大使</strong>：找出可以在不同部门之间进行“翻译”的大使。这对创新的中间赛段尤为重要，在这个时候业务和财政部门的领导必须与人力资源以及市场部门的领导通力合作。一个好的”翻译“大使将会在这些存在对立特性的部门之间穿梭，能够将一方的观点正确的翻译给对应一方知道，并找出一个可以平衡各方不同的视角的方法。</p>\n<p><strong>职能轮换</strong>：为各个领导安排一些不同赛段的临时任务，好让他们可以掌握创新过程中不同三个赛段的运作经验。现实中，在一个部门中的专家往往却会对另外一个部门的事情一窍不通。尝试将研发部的成员安排到工厂或者运营部门一段时间，这样他们才会真实体验到究竟需要怎么做，才能让他们的研发成果变成产品。反过来，也可以将工厂的成员安排到研发部一段时间，这样他们才能真正体验到，研发出有竞争力的产品究竟需要多大数量级的创新。让这些不同赛段的“参赛者”们对其他赛段有真实正确的认知。</p>\n<p>你应该不会想在创新接力赛的某个环节不小心把接力棒给掉地上。所以你应该不断的对这些交棒过程进行练习，改进，最终臻于完美。过程中确保别让你的接力棒掉到地上，顺利高效的完成你的交棒工作，那么就算竞争对手在某个赛段有个“飞毛腿”级别的快男，也不足为惧了。</p>\n<p>&nbsp;</p>\n<hr>\n<p><span style=\"color: #999999;\"><em>注:更多文章请关注公众号:<strong>techgogogo</strong>或官网<a href=\"http://techgogogo.com/\" target=\"_blank\" rel=\"noopener\">www.techgogogo.com</a>。当然，也非常欢迎您直接微信(<strong>zhubaitian1</strong>)勾搭。欢迎转发转载，转载时务请注明公众号信息。</em></span></p>\n","categories":[{"name":"创新","path":"api/categories/创新.json"}],"tags":[]}