{"title":"RethinkDB创始人教你如何找到创业点子","slug":"RethinkDB创始人教你如何找到创业点子","date":"2015-03-16T01:20:00.000Z","updated":"2017-07-17T07:02:00.000Z","comments":true,"path":"api/articles/RethinkDB创始人教你如何找到创业点子.json","excerpt":null,"covers":["http://img.blog.csdn.net/20150227153939988?watermark/2/text/aHR0cDovL2Jsb2cuY3Nkbi5uZXQvemh1YmFpdGlhbg==/font/5a6L5L2T/fontsize/400/fill/I0JBQkFCMA==/dissolve/70/gravity/SouthEast"],"content":"<div id=\"article_content\" class=\"article_content\">&#13;<br>        <div class=\"markdown_views\"><br><br><img src=\"http://img.blog.csdn.net/20150227153939988?watermark/2/text/aHR0cDovL2Jsb2cuY3Nkbi5uZXQvemh1YmFpdGlhbg==/font/5a6L5L2T/fontsize/400/fill/I0JBQkFCMA==/dissolve/70/gravity/SouthEast\" alt=\"\"><br><br>(注:此文乃文章《<a href=\"http://blog.csdn.net/zhubaitian/article/details/44044865\" target=\"_blank\" rel=\"noopener\">RethinkDB创始人教你如何打造一个伟大的产品</a>》姊妹篇，欢迎参考阅读。更多最新文章请关注本人微信公众号:techgogogo)<br><br># 关于作者<br><br><em> </em> <em><br><br>我叫Slava Akhmechet，本人是 <a href=\"http://www.rethinkdb.com/\" target=\"_blank\" rel=\"noopener\">RethinkDB</a> 的创始人之一，RethinkDB是开源，分布式数据库，旨在帮助开发人员与运营商在打造实时应用时处理无结构数据<br><br># 如何选择创意\n\n</em> <em> </em><br><br>25 Feb 2015<br><br>宏观上说，根据本人的经验我认为运作一个初创公司首先需要知道的一件非常重要的事情是，创新市场的反应是非常高效的。如果该市场环境适合一个初创企业发展起来的话，那么非常有可能市场上已经有多个类似的初创企业存在了。反之亦然 - 如果该市场上不存在任何初创企业的话，那么非常有可能该市场环境并不友善，所以初创企业才没有冒出来。<br><br>从这个层面上说，初创企业就好像一个有机生命体。只要生态环境适合的话，就会有生命的存在。不同之处只是初创企业是生存于经济环境身上而非真实的生态环境上而已。<br><br>这种情况就很大程度的影响了你如何选择你的创意，因为技术创业往往是一个成王败寇的情况，赢了你就得到所有，输了你就片甲不留。所以第一家解决了客户问题的企业所占有的市场份额往往会比其他后来者加起来的都还要多。所以，如果现在已经有一个类似你的创意的企业在该市场中存在的话，那么你就不大可能可以替代它了。<br><br>传统智慧常常告诉我们初创企业需要往去解决人们碰到的问题的思路方向去走，但是如果使用这种方式来过滤究竟哪些创意适合创业的话总感觉有点太泛了。市场反应效率预示了如果一个问题真的是有价值和可解决的话，那么很有可能改问题已经有了解决方案了。反过来说，如果该问题还没有被解决的话，那么很有可能该问题的解决方案存在结构性原因以致解决它是一件不可能的事情。<br><br>对于投资人来说，鼓励创业者去往解决不同的这些问题确实是个致胜策略，因为大数定律决定了获胜的天平倾向于投资人这边。投资人投资的大部分这种初创企业很有可能都会以失败告终，但是这并没有关系，只要投资人撒的网足够大，投资的企业足够多，那么只要其中有一两个成功了它就能赚的盘满钵满了，因为如前所说，这是一个成王败寇的游戏，赢家将会赢得该市场几乎所有的份额。<br><br>但是，对于创业者来说，这却是一个非常糟糕的策略，因为大数定律决定了赢面并不在他们这边。单个创业者并没有足够的资金来尝试解决多个不同的看似有价值的问题来获得预期的效果。所以创业者需要马到功成的话，必须更严谨的对他们的创意进行过滤，找到最有可能成功的创意。<br><br>如果你不能取代当前已经存在的技术公司，且很有可能该市场环境并不允许那些存在的未解问题得到解决，那么你想在该市场中打造出一个成功的初创企业又谈何容易呢？<br><br>一个看上去有点荒谬的解决方案是，在初创企业萌芽期，我们先不去考虑通过解决存在问题的方式来找到我们的创业创意，而是去考虑经济环境的改变以及这种改变所带来的机遇，而从中找到我们的创业创意。<br><br>有如生态环境一样，经济环境同样也是不稳定的。社会的道德指南针常常会变。政治环境会根据社会道德而发生改变，一个国家也会因吸纳了自由宽松的法律条文而发生变化。生活在发展中国家的人们会慢慢变得富有。一门技术到达临界点时，只需要几个小小的继续改进，该技术就可能会产生从量变到质变的飞跃。<br><br>环境的变化释放了创业机会。而又因为技术创业是个成王败寇的战场，所以你如果能最先够意识到市场的改变然后立刻进入市场并为该市场带来一个可行的解决方案的话，这将会大大的增加了你长期占领该市场的成功几率。<br><br>所以在创业初期要经常自问 - 当今世界在发生什么变化？且我能针对这些变化做些什么事情呢？一旦你确定了环境已经发生变化且当前进入该市场并不是太迟的话，你就应该去按照上面提过的“<a href=\"http://www.defmacro.org/2013/09/26/products.html\" target=\"_blank\" rel=\"noopener\">解决未解问题</a>“的思路来找到你的创意来进行创业了。<br><br># 先行者优势<br><br><em> </em> <em><br><br>根据环境的变化来孵化并评估自己的创业创意是一个很好的开始，但是这并不够。在你发现这种创业环境的变化的时候，很多其他的人也同样会察觉到。比如，当一个杂志报道一篇某种潮流正在改变的文章的时候，该杂志所获得的信息往往就是从几个正在在该市场上冒起的公司中得到的。<br><br>如果你是第一个把你的产品推入某个市场的，你的客户会比较你的产品和当前的潮流。你将会抢先获得一批早期的采用者 - 这是一批追赶潮流的弄潮儿，如果你的产品是很优秀的话，一些保守的用户也会逐渐投入你的怀抱而让你的阵营变得越来越强大。<br><br>如果你是第二批把你的产品推进某个市场的话，你的客户将会拿你的产品和其他先进入该市场的公司的产品进行比较。这种情况下，你(想成功)的难度将会数量级别的倍增。再在现有状态下烧钱去追赶潮流已经是远远不够的了。这时你就要去找到一个亮眼的和先进入该市场的公司的产品的差异之处作为强势切入点来进行竞争，而经验告诉我们，要做到这一点是比创业者所设想的异常困难得多的。<br><br>经济学上的“先行者优势”在科技公司的成长需要多个复合过程的情况下变得越加剧烈和明显。创建一个组织需要时间，成立企业，募款，招聘，研发，打入市场，销售渠道，发货等轻轻松松的就会耗掉你至少几个月的时间。如果你不是首批进入这个市场的，在你还在跌跌撞撞的发货的时候，你的竞争对手将很有可能已经在着手研究如何占领更多的用户了。在此过程中他们会得到更多的资源来帮助他们在你之前获得指数级别的用户数量的增长，而你却要受困于向用户解析你提供的产品跟人家提供的有什么特别之处。大多数情况下，这就意味着你的公司已经做死了!<br><br># 洞察潮流风向\n\n</em> <em> </em><br><br>因此，你应该让你的产品在还没有任何竞争者的情况下就进入市场。经验之谈，你不可能在该市场中作为后来人而想后来居上。即使在其他已有的大部分竞争者竞争能力都不咋滴的鲜有的情况下也不应该这样做，因为就算只有一个有能力的竞争者比你先进入市场就会大大的降低你成功的可能性。你必须在别人之前先找到一个适合创业的潮流趋势，在该市场广开大门的情况下开始大展拳脚。<br><br>世界上没有一个公式能预知趋势的风向的改变，但是你可以培养你自己的独特的洞察力来感知它。比如，你可以根据你的工作内容或者你的爱好来培养这种洞察力。语音识别研究员很有可能比我早几年就能洞察到该技术将会火爆起来，因为我是在语音识别产品已经开始冲击市场的时候才洞察到该技术的存在的。<br><br>有时候你独特的背景知识也会帮助你比别人更早去意识到风向的改变。如果你看到了一个貌似有道理的描述为什么世人对某某东西竟然都一无所知的故事，也许就会带给你一个创业的合理的先机。比如，也许你想到了在第三世界的某些国家生活的人们还不清楚侨汇的重要性，然后该第三世界国家刚刚拥有的足够的网络覆盖率，那么你也许就可以从电子汇款作为出发点来拓展你的创意以获得成功了。<br><br>你自身拥有的一些独特的优势也有可能让你处于探索创业风向变动的好位置。有些方面的改变是每个人都有可能插一脚进去的，而有一些改变也许需要很深厚的专业知识背景或者需要连企业家都不愿意投入的巨大的努力才能去实现的。无人驾驶汽车也许在这里是一个很好的例子：每个人都在吹嘘自己是如何站在无人驾驶汽车研发的最前端，但是最终只有Google有办法整合所需的专家，资本和决心来走完最后一英里。<br><br>当然还有其他方式来让你占尽上风。比如，如果你拥有一个大公司的资源在手上任你处理的话，你也许会比别人晚一步进入市场，但是你依然可以通过运用庞大的市场预算或在公司已有的分销基础的基础上代打败你的竞争者。但这种情况在创投的现实世界中毕竟是少之又少的。初创企业往往不是因为拥有巨大的资源而制胜的 - 他们的成功往往是因为他们洞察到了潮流的改变然后首先把产品推进了该市场。<br><br># 把你的创意编成一个好故事<br><br><em> </em> <em><br><br>以世上正在发生的变化作为方向来思考你的初创企业不仅仅会很大程度上让你的初创企业获得成功，因为它是一个更优秀的技术创新思考模式。除此之外，它还会给你带来更多的惊喜。<br><br>在你的初创企业的起步阶段你必须和很多人进行交谈互动 - 潜在用户，顾问，投资商，行业专家，早期员工，甚至记者。这些人问你的第一个问题往往就是“你这企业是干什么的？“。 所以应该如何告诉人们你正在打造的是什么东东将会是你需要解决的第一个战略性的问题。<br><br>如果你以讲故事的方式来对描述一个事物的话，人类往往都很乐意去给出反馈。所有的故事往往都使用同样的基础框架。下面就是一个简单的来自著名的皮克萨斯动画工作室的告诉我们应该如何说故事的框架规则：<br><br>&gt; 在过去(). 每一天().有一天(). 因此() . 因此().直到最后().<br><br>第一部分就是布局。从前的世界以一种特有的方式在运行，在这里的意思就是向人们描述清楚该方式对人们意味着是怎么一回事。下一部分就是去描述世界正在发生的变化。这一部分所描述的东西可能跟你的初创企业没有半毛钱关系 - 你在描述的正在改变的环境的客观事实跟你是否准备开个公司对听众来说能有多大关系呢？记得我们前面谈过市场的反应是非常高效敏捷的吧？就算你不开个公司打造相应的产品来拥抱变化，也会有其他人来做这个事情。你的目标应该是作为第一个去把你可行的产品推向市场的人，这通常就会帮助你去成功占领对应的市场。<br><br>只有你描述清楚了这个世界正在发生的这些改变，你这才能开始去描述你的产品和你的公司。世界的改变不因你的行动而停止，你只需要”碰巧“的提前知道了这种改变就足够了。<br><br>最后一部分展现的是你的公司将会如何改变人们的生活。当你的公司茁壮成长到足够大以致拥有了大部分的市场份额的时候，你就将会有能力成为下一次环境发生变化的推手。在这种方式下你的初创企业就会完成技术创新的一个轮回。<br><br>以下就是一个一流的公司应该如何按照上面的模板陈述它们的故事的例子：在过去，人们购买的汽车都是用内燃机进行驱动的。但有一天，随着电池技术已经变得越来越便宜。因此，我们可以考虑用电池来打造一个电动的交通工具。但是也许这个时候相对来说还是非常昂贵，那么我们可以先出豪华奢侈版去占领高端市场。随着电池技术变得足够便宜的时候，我们再开始考虑打入低端市场。直到最后，我们就可以颠覆整个汽车行业以使得世上的每一辆汽车都是电动的。<br><br>这种以说故事的方式来描述你的创意的方式可以非常有效的把你的初创公司往前推进。早期用户，员工和顾问将会更有可能被吸引过来，因为你是在邀请他们来共同踏上实现该创意的一次旅程。而投资商也会更容易抛出橄榄枝，因为这符合他们的行事方式。说到记者的话，他们更加没有理由不进行报道来帮你做推广，因为你已经通过写故事的方式帮他们完成他们本要自己完成的工作了。<br><br>一个好的故事可以给你带来巨大的描述力量来向不同背景人和团地表达清楚你究竟在搞什么飞机。除此之外，其实一个好的故事还具有另外一个更重要的好处，那就是：创意规范化 - 一个好的故事将会告知你你的决定是否正确，且强迫你去做一些原则性的选择。如果你将要做一个跟你所要讲的故事风牛马不相及的决定的时候，你就需要很明确的去选择究竟是要重新评估该决定呢还是要重新调整你所要讲述的故事。初创企业早期往往会被卷入无数个的需要做不同方向的选择的漩涡之中，这些企业如果夭折的话往往更多是因为他们对这些决定作出的折中考虑而不是因为他们选择了一条错误的道路。一个好的故事会让你必须对自己和所有人坦白，以阻止你去做个老好人去四面逢迎而葬送大好创意，让你可以保持清醒的头脑来往一个清晰具体的方向迈进。<br><br># 例外 - 世事无绝对\n\n</em> <em> </em><br><br>创新市场高效反馈性和先动者优势导致的第一个进入市场的公司根本无法被撼动的这两个观点一直存在争议，因为我们很容易就能找到现实存在的并没有完全符合这两个规则的反例出来。<br><br>以上一年被苹果以30亿美元收购掉的Beats耳机公司为例，该公司其实打破了本文描述的所有规则然后依然获得成功，究其原因是因为流行音乐这种潮流行业公司天生就是变幻无常且充满不稳定因数的。再看微软的Surface平板电脑，虽然微软后来提供的Surface平板跟市场已有的产品并没有太大的差别，但它依然可以在这个已经很成熟的市场中获得一定程度的成功，皆因微软有足够的市场预算资金。其实一个市场中往往潜伏着很多多年没有被发现的机会，很多深层的技术问题直到有人某天突然解决掉之前，该问题也许也已经存在了数十年了。即使看上去势不可挡的高速发展的公司有时也会犯下没有及时发现潜伏的机会等这些致命的错误，而最终把自己送上了不归路。<br><br>在创业界，这些例子其实都可以划归成一种例外的情况，而不是一个正常的遵循了创业规则的情况。大部分创始人其实都不能像Beats一样可以通过和一个嘻哈歌手进行合作而帮助自己成功，他们也不能很有效的以最小代价来在一个十亿美元级别的市场竞争中做出有效的执行（但不幸的是他们往往觉得自己可以做到）。创业者在剑走偏锋不走寻常路时往往都会觉得自己是一种如上所示的成功的一个例外，而事实上在创业界里这并没有你心里想的那么特别。<br><br>如果你确信自己找到了这种例外的时候，那么你可要小心了。很多初创企业在一开始的时候都意味找到了一个捷径，然后耗了多年之后才发现走错了，这都是因为创始人当时没有搞清楚市场的高效反应和先动者优势这两条规则才是正道。所以，敬请你好好思考一下这些规则，然后好好的理解它们。例外确实存在，但请确保你真正的清楚你是在做什么。你需要先学习好正统的规则，然后才能创建出你自己的规则来。<br><br># 自欺欺人 – 别把创意故事编成虚幻小说<br><br><em> </em> <em><br><br>以环境变化带来的机会的方式来找到初创企业的创意的方式所带来的一个需要警惕的副作用是，正因为这种方式是如此的有效，所以你很容易被你早期的轻松的成功所蒙蔽双眼。聪明且有足够决心的企业家可以为几乎所有的创业创意找到证据来支持环境已经发生变化的事实。如果你确定要投身于打造一个食物送货上门的服务的话，你通常可以编造出一种假设，然后围绕该假设来编织一个跟你的产品相关的故事，然后加入一些可信的支持你的假设的数据，并逐渐把你的故事打磨得足够高格调以致大量的用户开始对此深信不疑。不幸的是，你将会打造出的是一个天花乱坠的虚幻小说。<br><br>因为你自己是如此迷信自己所给出的假设，以致你不知不觉的开始对不利因数和证据视而不见了，这个过程就相当于用科学界的”确信性偏见“来破坏了正确的科学方式。”确信性偏见“在科学界是致命的，同样，其在商业界也是致命的。<br><br>通过虚构小说的这种方式，你的公司可以非常容易的就吸引到惊人的大量的资金，大量的精英也会投身其中，媒体也会对你的公司非常感兴趣，而这些东西在这种情况下反而会把你的公司推向悬崖边上。我曾经见过有人把别人投进来成千上万美元的资金燃烧殆尽，过程中还耗费了数百个人-年在该项目上面，因为他们不知不觉的编织了一个非常引人入胜的虚构小说，然后被初期获得的一些成功冲昏了头脑以致连自己的对该虚幻小说深信不疑了。<br><br>所以，你的创意故事不仅仅需要引人入胜，更重要的是该故事需要是一个正确的故事，而不是一个虚幻小说。<br><br>如何去评估一个创意故事的正确性是一个异常富有挑战性的艺术，做出这个评估需要涉及到多个不同的科学 - 经济学，科幻小说，历史学，人类学，以及社会学。你需要对这个世界有深度的认识，并且投入多年的努力来打造出自己对未来做出正确判断的灵敏直觉。即使如此，你也只能保证你在一部分时间内做出的判断是正确的。但只是这样已经比起之前的随机选择好多了。<br><br># 直觉敏锐度\n\n</em> <em> </em><br><br>以下是我看过的一些帮助我去思考和把握未来变化的一些资料。我使用它们来学习如何编织好我的创意故事，并且把自己对判断这些创意故事是否正确的直觉打磨敏锐。<br><br><em>   阅读几个月<a href=\"http://www.economist.com/\" target=\"_blank\" rel=\"noopener\">经济学家</a>上面的文章是一个和传统智慧保持同步的一个很好的方法。经济学家网站上的作者很擅长于对未来进行思考(但请记住这些作者并没有压力去向你确保他们的观点是正确的)。\n</em>   Peter Thiel的”<a href=\"http://www.amazon.com/Zero-One-Notes-Startups-Future/dp/0804139296\" target=\"_blank\" rel=\"noopener\">从无到有</a>“这本书非常棒。相比来说，其他的一些商业书籍都很垃圾，但这本书确实出类拔萃。<br><em>   <a href=\"http://hpmor.com/\" target=\"_blank\" rel=\"noopener\">哈利波特和方法的合理性</a>很有启发性。Harry在该书前11章所描述的事情恰恰正是你所需要学习的。”规则是很不一样的，在着这个世界上存在着魔法。那么现在怎么搞呢？我可以从巫师银行的金币加隆/西可中套利以致富吗？</em>   同样，我也会去时不时的浏览<a href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/HomePage\" target=\"_blank\" rel=\"noopener\">TV Tropes wiki</a>来防止我在编织一个虚幻的创意小说。<br><em>   William Gibson的随笔<a href=\"http://www.amazon.com/Distrust-Particular-Flavor-William-Gibson/dp/042525299X\" target=\"_blank\" rel=\"noopener\">别相信所谓的特色风味</a>帮助我深入的去思考在现实世界中的技术创新。\n</em>   类似地，Neil Postman所编写的<a href=\"http://web.cs.ucdavis.edu/~rogaway/classes/188/materials/postman.pdf\" target=\"_blank\" rel=\"noopener\">关于技术趋势改变我们需要知道的五件事情</a>对技术的考虑有着独到之处。他对技术创新其实并不看好，但是依然，他持有一个独特的有用的方法来思考究竟技术是如何大行其道的。<br><br>一旦你看完了以上链接的类容，那么请继续往下挖得更深点。<br><br>尽你所能的多去学习微型经济学相关的知识以让你对这个世界究竟如何工作的由更好的理解。别仅仅去学习那些基础供应和需求，还要去学习更高深的如补给，替代品，弹性，边际效应等等。<br><br>要学习历史。但别只是去记住时间人命这些东西，而是需要问出高深的问题。为什么奥斯曼帝国尽管在和欧洲其他民族国家拥有相似的经济和技术开发水平的情况下，却从来没有建立起一套封建制度出来呢？为什么蒸汽机的发明者并没有从他们的发明中获得最大的回报呢？ 为什么中国文明并没有在其鼎盛时期去征服欧洲呢？当时中国的发达程度可是远远超过欧洲的。<br><br>对人类学和民族学要有基本的了解。要搞明白<a href=\"http://en.wikipedia.org/wiki/Emic_and_etic\" target=\"_blank\" rel=\"noopener\">主位客位理论</a>来对人文文化习惯进行评估，并从中尝试学习对人文文化习惯的改变做出判断。<br><br>打好基础，然后从而创造出你自己的观点。如果你仔细的观察的话，你就会发现到处都有可以学习的东西。一旦你对这个世界有更深的认识之后，那么就应该立刻采取行动。去获取一个如果做出好的判断的直觉的最好办法就是去真正的做出决定，让后观察其结果。所以别让自己深陷在分析麻木症当中，要善于且勇于分析。开创自己的公司吧，并开始在你所犯的错误中自我学习并成长。<br><br>最后非常感谢Michael Lucy帮忙对本文的审核以及所作出的贡献。<br><br>———完———-<br><br><em> </em> <em><br><br>引用英文原文：<a href=\"http://www.defmacro.org/2015/02/25/startup-ideas.html\" target=\"_blank\" rel=\"noopener\">http://www.defmacro.org/2015/02/25/startup-ideas.html</a><br><br>作/译者：Slava Akhmechet/天地会珠海分舵<br><br>微信知识共享公众号：<em>*TechGoGoGo </em></em><br><br>CSDN：<a href=\"http://blog.csdn.net/zhubaitian\" target=\"_blank\" rel=\"noopener\">http://blog.csdn.net/zhubaitian</a><br></div>&#13;<br>        <script type=\"text/javascript\">&lt;![CDATA[<br>            $(function () {<br>                $(‘pre.prettyprint code’).each(function () {<br>                    var lines = $(this).text().split(‘n’).length;<br>                    var $numbering = $(‘<ul/>‘).addClass(‘pre-numbering’).hide();<br>                    $(this).addClass(‘has-numbering’).parent().append($numbering);<br>                    for (i = 1; i &lt;= lines; i++) {<br>                        $numbering.append($(‘<li/>‘).text(i));<br>                    };<br>                    $numbering.fadeIn(1700);<br>                });<br>            });<br>        ]]&gt;</script></div>","categories":[{"name":"创业","path":"api/categories/创业.json"}],"tags":[{"name":"创业","path":"api/tags/创业.json"}]}