{"title":"从孙子兵法看企业价值观和企业文化","slug":"sunzibingfa_and_enterprice_culture","date":"2015-06-28T04:17:40.000Z","updated":"2017-07-17T03:11:10.000Z","comments":true,"path":"api/articles/sunzibingfa_and_enterprice_culture.json","excerpt":null,"covers":["http://upload-images.jianshu.io/upload_images/264714-53e3b7386e207fc9.jpg?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240"],"content":"<h2 id=\"\"><a href=\"#\" class=\"headerlink\" title=\"\"></a><a href=\"http://upload-images.jianshu.io/upload_images/264714-53e3b7386e207fc9.jpg?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240\" target=\"_blank\" rel=\"noopener\"><img src=\"http://upload-images.jianshu.io/upload_images/264714-53e3b7386e207fc9.jpg?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240\" alt=\"孙子兵法\"></a></h2><p>编者注：<a href=\"http://www.onlyonceblog.com/2015/06/the-difference-between-culture-and-values\" target=\"_blank\" rel=\"noopener\">本文英文版</a>的作者是来自Return Path公司的Matt Blumberg, 中文版由天地会珠海分舵编译。孙子曰：“兵者,国之大事也.死生之地,存亡之道“，这个就是国家这个大企业永恒不变的价值观。而孙子又曰：”兵无常势,水无常形“，你怎么用兵，形式多种多样，不应拘泥形式。也就是说只要你的核心价值观是对的，你的企业文化这个表现形式就可以因时因势而变。</p>\n<p>&nbsp;</p>\n<h2 id=\"混乱的企业价值观和企业文化认知\"><a href=\"#混乱的企业价值观和企业文化认知\" class=\"headerlink\" title=\"混乱的企业价值观和企业文化认知\"></a><span style=\"color: #993300;\"><strong>混乱的企业价值观和企业文化认知</strong></span></h2><hr>\n<p>其实这个问题同样困扰了我很长一段时间了，所以这里我想通过本文来将这个困扰给解决掉，也希望能给大家进行解惑，同时也欢迎大家在评论种给出自己的观点。</p>\n<p>在我们的公司<a href=\"http://returnpath.com/\" target=\"_blank\" rel=\"noopener\">Return Path</a>中，我们有着一套<a href=\"http://www.onlyonceblog.com/2011/12/return-path-core-values-part-ii\" target=\"_blank\" rel=\"noopener\">核心价值观</a>的同时，还有着我们引以为荣的企业文化。我们曾经多次获得“员工最佳企业选择”的奖项，包括荣获财富杂志评论出的<a href=\"http://fortune.com/2014/09/18/50-best-small-and-medium-size-companies-to-work-for-2014/\" target=\"_blank\" rel=\"noopener\">美国中型企业工作环境排名季军</a>。</p>\n<p>问题是价值观和公司文化这两个东西是不一样的，且这常常给人们造成混乱。我经常听到我们公司以及外面的其他公司的员工说些出这样的一些话，比如，“你不能这样子干，这不符合我们的公司文化，”，或者，“我喜欢在这工作，因为这里有着伟大的公司文化”，又或者是，“我希望我们的公司文化永远不会变更。” 而正是这样的一些言语，揭示出了人们对公司文化和公司价值观认知的混乱。</p>\n<p>下面继续之前我尝试先对它们给出我自己的一个定义。</p>\n<ul>\n<li><strong>价值观</strong>：价值观是我们做一个决定的指导方针，也是我们用来判断哪些东西是重要的，哪些东西是正确的判定依据。价值观一旦设定，就不能随意更改。</li>\n<li><strong>企业文化</strong>： 文化是形成一个工作环境的商业活动，业务处理，以及交流互动的集合。企业文化是价值观的表现形式，会因时因势而变。<br>这里大家可以参考下《孙子兵法》的描述，孙子曰：“兵者,国之大事也.死生之地,存亡之道“，这个就是国家这个大企业永恒不变的价值观。而孙子又曰：”兵无常势,水无常形“，你怎么用兵，形式多种多样，不应拘泥形式。也就是说只要你的核心价值观是对的，你的企业文化就可以因时因势而变。</li>\n</ul>\n<p>&nbsp;</p>\n<h2 id=\"价值观是河床\"><a href=\"#价值观是河床\" class=\"headerlink\" title=\"价值观是河床\"></a><span style=\"color: #993300;\">价值观是河床</span></h2><hr>\n<p>一家企业的价值观一旦定下来就不应该再进行改动。价值观就应该像是咆哮飞奔的长河下面的河床一样，无论河流(企业)是如何的快速往前飞奔，但是承托支撑着河水并引领其前行的河床(企业价值观)却是10年甚至100年都不会改变的。价值观作为一家企业赖以生存的核心原则以及游戏规则，是永远不能妥协的。</p>\n<p>比如，你今天把“透明度”视为公司的一个价值观，明天你觉得透明度导致了你不能玩一些政治手段，所以你就想把这个价值观给改掉，这样可行吗？</p>\n<p>所以你真需要进行改动的话，你就要像地壳构造运动那么缓慢的对其进行非常细小的改动和调整。否则，如果你朝令夕改般的将你昨天的价值观今天就进行大幅度改动的话，那么就好像你现在拿着个冲击钻对着块石头一样，一下子就会对这块石头造成永久性的破坏，你是没法再进行修复的了。</p>\n<p>所以你从一开始就应该认真的对公司需要遵循的价值观进行仔细思量，要确立的是一个可持续发展的价值观。除非你的初创企业一下子变成了一个巨型公司，你亟须修改你之前的价值观来保持团队旺盛的斗志来让大家变得更高效。但是这种情况就像你买六合彩一样，不是不可能，只是这种情况发生的几率就如“疯狂的石头”那部电影上老包说的一样，“雷劈中你八次你也中不了一次“。</p>\n<p>另外一个解决办法就是，如果多年以后你发觉有一个新的价值观需要考虑，那么与其修改原来既定的，你倒不如去增加一个新的价值观。比如我们就在时隔多年之后，因为需要进行国际化，而增加了一个新的叫做”全球化思维，本地化行动“的价值观。</p>\n<p>&nbsp;</p>\n<h2 id=\"文化是两岸风景\"><a href=\"#文化是两岸风景\" class=\"headerlink\" title=\"文化是两岸风景\"></a><span style=\"color: #993300;\">文化是两岸风景</span></h2><hr>\n<p>如果一个企业的价值观好比一条河流的河床的话，那么一个企业的文化就好比该河流上面及两岸的风景。文化就是你的商业发展过程中所需要的价值观的具体表现形式。两岸的风景会随着时间和事件而改变，有时会因为季节变化而暂时性的发生改变，有时又会因为一场风暴而雪而彻底改头换面，有时又会因为如城市化发展需要，或者园丁的巧夺天工之手艺，这些人为的因素而发生变化。</p>\n<p>那么，究竟所谓的“文化就是你的商业发展过程中所需要的价值观的具体表现形式“这句话意味着什么呢？我们还是以上面的”透明度“这个价值观作为例子吧。如果你的初创企业现在只是一个由10个人组成的小作坊，透明度的价值观就意味着，作为CEO的你，会迫使自己将自己如何对打造产品以适应市场的思考跟大伙儿一块分享，然后搜集大家的意见和建议，并共同做出一个决定。</p>\n<p>而当你的团队发展到100个人的时候，透明度这个价值观又会表现为，这时你可能就不会在自己的想法已经足够成熟之前将其公之于众。当你的脑海中只有一个大概的方向的时候，如果你只找一部分人进行讨论和试验，你就会因为没有跟所有人公布而感觉有心理压力；而如果你跟所有人都宣布的话，意见太多又难于统一，最终可能就会引起不必要的争执以及方向的不统一。</p>\n<p>当你的团队发展到1000个人以及公司已经上市的时候，透明度这个价值观又会表现成，你只有在产品已经盈利的时候才会将这个消息向所有人公布，但此前应该已经有其中一部分人早知道这个产品的信息了。</p>\n<p>所以，透明度这个价值观并不是说你随时随地无时无刻的将自己脑袋里面所想的东西透明的展示给所有人。10个人的时候，你可能需要告诉其他人为什么你要炒掉老王，因为大家都认识老王；100个人的时候，你如果跟每个人都说你炒掉老王的原因是什么，那么这对老王来说也太不公平，太没面子了吧；如果有1000个人的时候你还这样做，那么你等着收老王的律师给你的律师函吧。</p>\n<p>&nbsp;</p>\n<h2 id=\"意见和建议\"><a href=\"#意见和建议\" class=\"headerlink\" title=\"意见和建议\"></a><span style=\"color: #993300;\">意见和建议</span></h2><hr>\n<p>我深信一个企业的文化如果不与时俱进的话，最终它必将迈进坟墓。所以我们必须保证我们的企业文化存在一定的机动性，因为文化是价值观的表现，而表现形式是可以多种多样的，而你长期保持一种形式无所变化的话，代表你这个企业很有可能一直都是在原地踏步。</p>\n<p>很多企业都会通过不断的成长或者扩张来保持机动性并相应对企业文化进行调整，也有企业虽然自身人员或者产品都是比较稳定的，但是所处的市场瞬息万变，这也会让这个企业保持很好的机动性。</p>\n<p>所以，即使一个如五金店和理发店这样的稳定的组织，如果它们没有根据社会形势和消费结构的变化而改变它们做生意的方式(即企业文化，如理发店师傅统一最新潮的制服等)的话，最终必然会以倒闭告终。</p>\n<p>&nbsp;</p>\n<p><strong>所以这里我给领导者的建议是</strong>：随着你的公司不断的成长，你不应该让你的企业文化墨守成规，而应与时俱进。同时坚守你公司的核心价值观不动摇，并在此基础上推进(或者同意)公司文化的改革。千万不要因为公司架构的改变以及工作模式的改变而改变公司的价值观。一个领导者需要做的事情就是将这些价值观进行具体化，通过影响/推进/引导的方式来形成具体的企业文化。这里你千万不要以为你能完全对公司文化进行控制，只有有勇无谋的领导才会这样子做。</p>\n<p><strong>对员工的建议</strong>：当你在工作过程中碰到一些你看不惯的事情的时候，仔细想想这究竟是不符合公司的价值观还是公司的文化。如果这是违反了公司的价值观的话，那么请毫无顾忌的大声说出来，指明这时一个违规行为。但如果这只是因为公司文化的变化而导致工作模式的变化，而依然符合公司的价值观体系的话，那么你就要三思而后行了。同时大家还需要注意的是，同一个价值观，不同的人可能会将它翻译成不一样的企业文化表现形式(比如“协作”这个价值观，有人喜欢通过电话沟通协作，有人喜欢通过网络协助工具，有人喜欢跑到你座位搬张凳子面对面进行互动，也有人喜欢在咖啡间边喝咖啡边聊..)，如果你是坚信你的企业价值观是对的话，也许你更应该去适应价值观的这些不同的文化表现形式，而不是去进行无谓的抱怨了。</p>\n<hr>\n<p><span style=\"color: #999999;\"><em>提醒：更多文章请关注公众号:<strong>techgogogo</strong>或官网<a href=\"http://techgogogo.com/\" target=\"_blank\" rel=\"noopener\">www.techgogogo.com</a>。当然，也非常欢迎您直接微信(<strong>zhubaitian1</strong>)勾搭。</em></span></p>\n<p><span style=\"color: #999999;\"><em>本作品采用[<a href=\"http://creativecommons.org/licenses/by/3.0/cn/\" target=\"_blank\" rel=\"noopener\">创作共用署名3.0中国大陆版许可证</a>], 欢迎转载，转载时敬请保留公众号等信息。本文首发虎嗅。</em></span></p>\n","categories":[{"name":"创业","path":"api/categories/创业.json"}],"tags":[]}