{"title":"博弈与共赢:一个VC眼中的PE","slug":"一个VC眼中的PE","date":"2015-05-19T05:59:50.000Z","updated":"2017-07-17T04:25:52.000Z","comments":true,"path":"api/articles/一个VC眼中的PE.json","excerpt":null,"covers":null,"content":"<blockquote>\n<p>编者注: 本文出自海外著名博客<a href=\"http://avc.com/2015/05/what-vc-can-learn-from-private-equity/\" target=\"_blank\" rel=\"noopener\">AVC</a>，中文版由天地会珠海分舵进行编译。作者从自己作为一个VC的角度，根据自己此前在欧洲和那边的PE进行交流的经历，对VC和PE之间可以互相借鉴的地方进入的深入的思考和论述，而我们作为创业者，相信也能从中学习到我们需要的东西…<br>本人上一段时间在欧洲和一个PE(私募股权投资)公司的任事股东Eric一块度过了一个星期，从事VC(风投)的我和从事PE的他就我们各自擅长的投资领域进行了一周的深入交流。交流之后我深有感触，事后一直在进行反刍，若有所思，沉吟至今。期间我也和另外一个擅长非控股型股权投资(也就是<em>少数股权投资 - Minority Investment</em>)的PE在我们投资组合中的某一家公司的董事会上有过愉快的交流。期间通过仔细观察和聆听他对投行的想法和经历，平心而论，我觉得自己还是从中学到了不少东西。</p>\n</blockquote>\n<p>其实风险投资和私募股权投资在投资上是存在不少原则上的根本区别的。虽然，它们两者都是对非上市企业进行投资，以期望所拥有的该公司的股权能在公司今后的并购/出售或者上市时能卖个好价钱；同时，它们两者也都可能会在所投资的公司的董事会中占有一席之地以便对它们的投资进行监管。但，它们的相同点也就到此为止而已。</p>\n<p>我之前曾经见过一些VC投资公司成功的在一定的时间内转型为PE投资公司，所以这很明显的暗示着，从投资的原则上，VC和PE应该还是有一些可以相互转换的技巧的。但即便如此，我还是认同上面所说的它们在投资原则上还是存在根本性的差别的。下面就是一些关键点的对比:</p>\n<ol>\n<li>PE属于控股型投资；而 VC属于少数股权投资。</li>\n<li>PE不能忍受任何一单投资的失败；而VC则往往广撒网，并预期有不少失败的投资存在(编者注:按照《从0到1》的Peter Thiel的说法，根据幂次定律，只要它们的投资组合中能有一个可以程指数级别暴涨(如Facebook)，它们就能赚得盘满钵满了)。</li>\n<li><p>PE通过金融工程来产生杠杆作用(也就是怎么用最少的自有资本产生最大的利益)，而VC通过追逐由技术所驱动的破坏性创新及其所产生的机会来产生杠杆作用。<br>那么究竟我们VC能从PE身上学到什么东西呢? 下面就是我这几个星期认真思考的结晶:</p>\n</li>\n<li><p>我们很多VC对所投资的公司经常是唯公司创始人之马首是瞻，更甚者，有些VC甚至没有在所投资公司的董事会中占取任何席位。<span style=\"line-height: 1.5;\">我们VC经常将为公司”增值“这个词挂在嘴边，但往往这只是敲定这笔投资之前的一个噱头而已，一旦敲定之后，VC给公司所带来的增值往往比你所想像的要少得可怜得多。</span><span style=\"line-height: 1.5;\">而PE得做法就有很大不一样了，PE整天在想的事情就是如何为这笔生意增值。非常确定得一个事实就是，这是PE公司自己得生意。如果公司给搞砸了的话，要怪只能怪他们自己了。</span>所以PE对所投资公司的关心和关注程度是非常之高的。优秀的PE往往是他们所投资的公司的出类拔萃的“操盘手“，甚至可以帮公司提升到改变行业游戏规则的高度。自从经过和Eric在欧洲一周的会谈之后，我就打定决心在回来后将这些经验应用到我们所投资的更多公司里面了，因为这实在太强大了。也许作为VC的你在听了这话之后会立刻打退堂鼓并说：“因为我们并没有对所投资的公司控股，所以就算我们真想做多点，我们也并没有能力改变公司管理层面的决策。且我们并不想陷入到所投资公司该如何运作的细节当中去。” 这我都赞同。但是，你其实并不是非要完全控制所投资的公司，才能对其管理团队、策略、和运作产生足够的有意义的影响的。我相信，如果你真的是值得公司的管理团队所信任的话，如果你在他们需要你的时候立刻能出现在他们身边(当然，如果他们觉得不需要你的时候你也应该立刻冒出来)的话，如果你有做好足够的功课来对所投资公司、团队、市场、以及机遇有充分的了解的话，这样你就完全可以通过你的智慧来对公司产生实质性的影响。我自己是非常乐意花时间和精力来把这些应用到我们所投资的公司中的，同时我也建议所有其他的VC也应该这样子做。</p>\n</li>\n<li>PE公司正常情况下是不会接受联合投资的。他们喜欢就他们自己一家对公司进行投资，并随后负责将该公司运作起来。联合投资，在运作良好且规模小的时候，往往效果非常强大。但是多数情况下联合投资所牵涉的投资公司的数目是非常大且功能失调的。这样的话大家这些投资公司就会七嘴八舌的对共同所投资的公司进行指手画脚，更甚者，会让大家互相推卸责任。对于公司的CEO来说，常常就受困于这些没有意义的事情上面：究竟应该听谁的？如果不同的投资者对公司的决策有不同的意见该如何处理？如何处理这一团糟的局面？所以我非常羡慕一个PE投资公司对所投资的公司拥有完完全全的话语权。让每个人都知道这个公司中谁是老板，谁拥有最终话语权，这对如何推动企业往前发展是非常有用的。而我们VC所做的是联合投资，所以我们往往会因为在共同投资的公司的董事会上相互扯皮掐架而痛苦不堪，如果再加上一个懦弱且没有经验的CEO的话，这就更是雪上加霜了。</li>\n<li>PE投资公司有权决定何时将所投资的公司出卖。而反观VC的情况，如果创始人有话事权的话将会由创始人来决定什么时候出售，要不然就是由董事会决定。无论是那种情况，单独的一家VC能决定什么时候将所投资公司进行出售的情况都是实属罕见的。大家可以看看Facebook较早前的一个例子，作为Facebook董事会成员的Marc Andreessen曾经宣称，当时Accel投资公司曾经想将Facebook以10亿美元左右的价格卖给雅虎，而当时创始人Mark Zuckerber事实上是并不乐意的(且期间Marc Andreessen敦促着他不要卖)，所以最终Facebook才没有改姓雅。我不知道这个故事究竟是出自正史还是野史(这在创业界非常常见，企业成功之后往往会对以前发生的事情做些改动再广而告之，以符合他们的最大利益。)，但无论如何，有时VC并不能决定何时将公司出售其实某种程度上也是个好事。否则的话，当今世上也就不会诞生这么多独角兽级别的上市公司了。当然，这种做法也是当且紧当所投资的公司将来真获得异常成功时候才有效了。而往往我们投资的公司组合中的大部分公司都只能称得上不错而已，并没有达到出类拔萃的程度，所以此时如果能将公司卖给另外一个大鳄，以求每个人都获得一个不错的回报，这才是正确的选择。但遗憾的是这对VC来说是不大可能的，因为几乎没有一个VC可以单独拥有对所投资的公司由完全的话语权。</li>\n<li>PE投资公司非常擅长挖掘行业信息、找出企业存在的问题以及为这些问题提供解决方案并将其解决掉。而这在VC界是不多见的。原因之一就是，如果我们这样子做的话，公司的CEO会认为我们在对他们的公司搞破坏。原因之二就是，我们VC投资公司其实正常来说是没有像PE那么大的人力资源来去帮助企业做这些事情，我们往往更多的是提供一些咨询的服务。一旦所投资的公司蜕变成一个大企业，VC往往就会功成身退，因为VC在蜕变前所提供的咨询服务是非常有价值的，但是蜕变后，所投资的公司就已经很成熟了，不再需要这些咨询服务了。而反观PE，在整个公司的成长过程中我们都能看到他们的身影。<br>最终我意识到我需要对所投资的公司的成长阶段投入更多的关注，因为我们的回报往往是来自于将来程指数级暴涨的公司，所以如果我们此前就能将该公司的价值提高2-3倍(这往往是PE所追求的)的话，那么我们将来就有可能从这些可能成为独角兽级别的企业中获得50-150倍不等的更好的回报，这个差别是非常巨大的。所以尽管我现在还没有看到自己拥有一支分析、咨询和深入研究大军，来协助我们所投资的最有可能胜出成为独角兽的企业，但我还是会竭尽所能来尝试做出更多的投入来协助这些企业，并为这些企业带来更多的“增值”。</li>\n</ol>\n<p><br></p>\n<div class=\"postmeta\">总的来说，这几个星期对PE的长时间的深入思考的收获就是，PE对所投资公司的责任非常明确，且有斩钉截铁的决定权和话事权，且很多时候对所投资的企业有着非常重的责任感和归属感。而这些都是我们VC需要学习的地方。虽然我们往往不可能对我们所投资的所有公司都一视同仁的进行等量齐观的分散投入，因为我们这些VC往往会同时投资8到10家甚至更多的公司。但是，我认为我们依然能够从PE身上学到不少东西，我们还是可以向他们借取一些智慧和战术过来，以为我们所投资的企业以及企业头创始人带来更多的价值！</div><br><div class=\"postmeta\"></div><br><div class=\"postmeta\"><br><br><em> </em> <em><br><br><strong>提醒</strong>:更多文章请关注公众号:<strong>techgogogo</strong>或官网<a href=\"http://techgogogo.com/\" target=\"_blank\" rel=\"noopener\">www.techgogogo.com</a>。当然，也非常欢迎您直接微信(<strong>zhubaitian1</strong>)勾搭。<br><br><em>*版权</em></em>:本作品采用[<a href=\"http://creativecommons.org/licenses/by/3.0/cn/\" target=\"_blank\" rel=\"noopener\">创作共用署名3.0中国大陆版许可证</a>], 欢迎转载，但转发时请保留联系信息，否则追究相应责任<br><br></div>","categories":[{"name":"产品","path":"api/categories/产品.json"},{"name":"创业","path":"api/categories/创业.json"}],"tags":[]}