{"title":"也谈怎么学好英语这件小事","slug":"也谈怎么学好英语这件小事","date":"2015-05-25T14:18:49.000Z","updated":"2017-07-17T07:29:22.000Z","comments":true,"path":"api/articles/也谈怎么学好英语这件小事.json","excerpt":null,"covers":null,"content":"<p>近来翻译了不少国外的创业产品类文章到简书和虎嗅以及36氪等。承蒙大家错爱，很多网友都觉得鄙人翻译的水平挺高的，然后速度也挺快的－基本上每天靠着晚上那点点时间都能有一篇文章出来。不少人开始问我英语应该怎么学？</p>\n<p>这里可能大家都只是在文章中了解到本人的英语还算有点水平，其实我个人的口语水平应该比书面英语更好，所以我今天就打算综合起来说说我是怎么学习英语的。当然，每个人都有自己的学习方法，但是，正如我的微信公众号所宣称的，他山之石可以攻玉！也许我的方法也有大家可以借鉴的地方，我们不妨互相借鉴下。</p>\n<p>简要的说，我觉得学习英语要解决这么几个问题：</p>\n<ul>\n<li>兴趣</li>\n<li>词汇量</li>\n<li>语感</li>\n<li>使用<br>下面我们尝试逐个击破。</li>\n</ul>\n<h1 id=\"兴趣是最好的老师，但兴趣不会从天而降\"><a href=\"#兴趣是最好的老师，但兴趣不会从天而降\" class=\"headerlink\" title=\"兴趣是最好的老师，但兴趣不会从天而降\"></a>兴趣是最好的老师，但兴趣不会从天而降</h1><hr>\n<p>首先，我非常认同一句话“兴趣是最好的老师！”。但是，兴趣像馅饼一样，不会从天上直接掉下来砸中你的脑袋。</p>\n<p>经过我近来对自己的迷茫人生的一些探索，我领悟到更深层次的一些东西。兴趣还真的是可以培养的！有些东西如果我们只是处于想的阶段，那么可能我们想破了脑袋也只是在想而已。你要去做，万事开头难，无论一开始你是多么的痛苦，只要你能坚持下去，慢慢你就会从中发掘到相应的乐趣的。 在创业界有一句话我觉得在这里也非常适用：“创意离开了执行力，将是分文不值！”</p>\n<p>之前看过一篇文章，描述说兴趣/激情其实就是你在做一个事情的过程中发现自己比别人做的好点，然后就会产生一种自我激励，会有一种欲望让自己更努力的去做的更好，最终产生一个良性循环。</p>\n<p>所以这里我觉得大家不妨先找一个大家水平旗鼓相当的团体，然后自己先暗自努力加把劲，让自己在某个时间内稍微超过小伙伴们，然后在跟小伙伴炫耀的过程中你就会发现自己慢慢开始喜欢英语这东西了。当你的兴趣越来越大的时候，你将会抛开你的小伙伴们一大截，然后你就是时候再另外寻找另外一个旗鼓相当的团体当实验田，继续上面的循环。当培养起了对英语的兴趣，最后我相信你成为英语高手的时间也就指日可待了。</p>\n<h1 id=\"背字典也有技巧\"><a href=\"#背字典也有技巧\" class=\"headerlink\" title=\"背字典也有技巧\"></a>背字典也有技巧</h1><hr>\n<p>这是我个人觉得非常好的增加词汇量的方法。当你有了高中的词汇量后，看一些一般性的文章应该已经不成问题了。但因为词汇量不足和语感没有形成，所以会影响你阅读的速度。这里我们先解决词汇量的问题，语感我们下一节再来解决。</p>\n<p>我觉得你想进一步拓展词汇量的方法就是背字典。我当年高中毕业后就花了一个假期的时间背了一本外研社的《英汉多功能词典》。</p>\n<p>但这个背字典也有诀窍。我是这样子做的：</p>\n<ul>\n<li>动手：将需要背的单词根据A-Z分类记下来。每个单词一定要自己造一句，越常用贴切越好；要把知道的反义词和同义词记下来。</li>\n<li>动口：把单词读一篇，然后是自己造的句子，把这个过程录下来。我当时是用磁带，录了整整四盘磁带。每次睡觉之前我都会听着入睡。</li>\n<li>分阶段： 一般词典对一些词会以是否是文语标识出来，文语是一般我们书面正规用的比较多的，日常生活其实比较上用到，所以我当时的做法是第一阶段先把非文语的单词先搞定。然后再迭代解决文语类的。注意一些明显非常偏的单词也别却背它，没有必要，美国人自己都需要查字典，你没有必要自讨苦吃。<br>你如果有坚持一个月的话，你将会发觉这是一个非常有趣的事情，然后你的速度会明显的加快。</li>\n</ul>\n<p>当中你也会发现有些分类的单词是很少的，比如O开头的单词其实就很少，你如果觉得受到打击的时候你就可以考虑先把这一类的单词搞定，这样你就会找回自己的信心了。</p>\n<h1 id=\"语感源于模仿\"><a href=\"#语感源于模仿\" class=\"headerlink\" title=\"语感源于模仿\"></a>语感源于模仿</h1><hr>\n<p>刚刚解决了词汇量，下一个要解决的就是语感，其实这两个也可以并行的做，并不是说非要有词汇量才会有语感。</p>\n<p>按照我自己的经验，我觉得语感是非常容易培养的。我记得当时我是这样子做的，在《新概念英语》第3本(多谢网友<a href=\"http://www.jianshu.com/users/223b9e7f432b\" target=\"_blank\" rel=\"noopener\">@云隐柏舟</a> 指出的错误，已改)中找出10篇文章，将它们背得滚瓜烂熟，期间要听配套录音，完全模仿人家的语调进行，到你能随时随地用同样的语调将任何一篇文行大声朗读出来的时候，你的语感就会有了。</p>\n<p>这个并不是虚言，我发觉语感跟语调是有很大关系的，一旦你看到新的文章中一个句子，你很容易就可以联想到你背过的文章中的类似的句子，然后心里面就会好像唱歌一样的用老美原声的语调把该句子从你的脑海中调出来。</p>\n<p>而当你和别人对话的时候，你也能基本不假思索的就将一句话给组织出来脱口而出了，因为英语句子的结构是很有限的，你要说的话句子结构，其实在你背的滚瓜烂熟的那十篇文章中肯定已经有出现过。</p>\n<h1 id=\"把它们用起来\"><a href=\"#把它们用起来\" class=\"headerlink\" title=\"把它们用起来\"></a>把它们用起来</h1><hr>\n<p>当你有了一定的语感和词汇量之后，你就需要将它们巩固了。因为只是不用了就会很快忘却的。</p>\n<p>口语方面我很难给建议，因为方法太多。你可以网上聊天，也可以英语角，也可以找个美国男朋友/女朋友…</p>\n<p>这里我主要是说阅读。阅读要找你自己感兴趣的方向的英文网站多去看。我自己喜欢NBA，所以我基本每天都会去NBA官方网站去看新闻，然后球赛也是看英文原版解说的。</p>\n<p>你会发现一开始的两个星期左右，你会觉得很困难，因为里面存在太多的术语。但，一旦你将这些术语都搞通了，你会发觉你很快就能像看中文一样快速的读完一篇文章了，最终你会慢慢觉得跟人聊天的时候还要想想某个单词应该怎么翻译成中文才能跟朋友描述清楚了。</p>\n<p>暂时先写到这吧，已经2:26AM了，文中可能会有些许错别字之类的，我就不Review了，大家看到了就把它挑出来，确实影响理解的话就在评论中帮我指出来，以便我改正后方便其他同学阅读，谢谢。当然，如果你有什么更好的学习英语的建议的话，也非常欢迎你在评论中提供出来给大家一起讨论，谢谢大家。</p>\n<p>最后欢迎大家加我的公众号，我们以文会友！</p>\n<hr>\n<p><strong>提醒</strong>:更多文章请关注公众号:<strong>techgogogo</strong>或官网<a href=\"http://techgogogo.com/\" target=\"_blank\" rel=\"noopener\">www.techgogogo.com</a>。当然，也非常欢迎您直接微信(<strong>zhubaitian1</strong>)勾搭。<br><strong>版权</strong>:本作品采用[<a href=\"http://creativecommons.org/licenses/by/3.0/cn/\" target=\"_blank\" rel=\"noopener\">创作共用署名3.0中国大陆版许可证</a>], 若非授权，转发时切勿删除联系信息，否则追究相应责任。</p>\n","categories":[{"name":"技术","path":"api/categories/技术.json"}],"tags":[]}