{"title":"泡沫你妹: 独角兽也许估值过高，但恐龙都将死去","slug":"恐龙都将死去","date":"2015-04-15T08:07:32.000Z","updated":"2017-07-17T04:39:21.000Z","comments":true,"path":"api/articles/恐龙都将死去.json","excerpt":null,"covers":null,"content":"<blockquote>\n<p>简介：<a href=\"https://medium.com/@davemcclure/bubble-my-ass-some-unicorns-might-be-overvalued-but-all-dinosaurs-gonna-die-fb0ce311a7bd\" target=\"_blank\" rel=\"noopener\">本文</a>乃来自Medium的一篇热文，中文版由天地会珠海分舵进行编译，原文在此文发稿时已获得675个推荐之多。砖家们近来对十亿美元级别公司估值是否过高这个问题是争吵得可谓面红耳赤不亦乐乎了，但他们很少有人意识到其实对上市公司进行估值本身就是一件代价高昂的难以精确的事情。考虑到那些笨重而尾大难掉的公司究竟将来还剩下多少现金流和营业毛利来支撑他们前行的情况，那么他们现在的市盈率达到15-20+这个水平看上去确实有点过于乐观了。除非他们可以加快脚步进行创新(或者将一个互联网行业的公司进行收编 - 以下将会说明原因)，否则这些<em>S&amp;P 500(标准普尔500指数）</em>所描述的500家企业恐龙必将会被十亿级别的独角兽运用软件和互联网市场的玩法所瓦解和摧毁，到时这些爬行类动物(恐龙)的小脑袋将会被独角兽拱得“肝脑涂地”。</p>\n</blockquote>\n<p>最近砖家们流行这样一种看法：认为十亿美元级别得独角兽企业被估值过高了。</p>\n<p>可以肯定的是最近不知道从哪里突然冒出来的大量号称估值十亿美元得公司确实是不少。然后还有不少是正在往独角兽俱乐部门口挺进的很有希望的公司(比如Uber，小米，Airbnb)，所谓一将成名万骨枯，在这些往前挺进的大量胜利者的脚下，其实踩着的也是大量的失败企业的尸骸。但也正是这种大相径庭的结局导致了大部分独角兽会被估值过高，而同时一小部分落在幂次定律中的低调而优秀的公司又会被严重估值过低。</p>\n<p>由于风险投资的本质就是这个样子，无论在哪个行业，一个大猩猩级别的企业会带走大部分的市场价值，剩下的体型小点的黑猩猩和猿猴级别的企业所占有的市值其实是微乎其微甚至为零的。当尘埃落定的时候，所有的猿猴企业(以及他们的投资商)都倾向于认为他们将会成为下一个冒起来的大猩猩…遗憾的是他们基本上都是错的。</p>\n<p>砖家们认为去预测那些重量级的独角兽和大猩猩级别的企业终将走向衰落也许是件不难的事情，但他们可能往往会忽视一个事实，很多上市企业(此文将会用“恐龙”这个词来形容这类企业)其实也存在估值过高的情况。</p>\n<p>为什么我个人认为这是个千真万确的事实呢？以下列出3个基本的原因：</p>\n<ol>\n<li><strong>恐龙往往都与创新无缘</strong>。这也不是新闻了；那些比我聪明和雄辩的家伙早就对这发表了不少相关的文章(“<a href=\"http://en.wikipedia.org/wiki/Creative_destruction\" target=\"_blank\" rel=\"noopener\">Schumpeter:创新的坟墓</a>，<a href=\"http://en.wikipedia.org/wiki/The_Innovator%27s_Dilemma\" target=\"_blank\" rel=\"noopener\">Christensen：创新者和困境</a>)进行论证了，所以我就不班门弄斧的从新撰文对这个观点再来炒一次冷饭了。这些恐龙企业很容易就会陷入沉溺于只关注营业额和利润的这个泥潭里面，然后就再也不会冒险去创新寻找更好的替代方案了。随着时间的流逝，他们慢慢就会丧失他们的优势。</li>\n<li><strong>恐龙很难俘获和留住顶尖技术人才</strong>。恐龙也许知道技术的重要性，甚至意识到“软件正在吞食整个世界”(编者注：该说法的出处请参考本人官网的文章《<a href=\"http://techgogogo.com/2015/04/%E5%85%A8%E7%90%83%E6%9C%80%E5%A4%A7%E7%9A%84%E9%97%AE%E7%AD%94%E7%BD%91%E7%AB%99%E4%B9%8B%E4%B8%80%EF%BC%8Cstack-exchange%E5%A6%82%E4%BD%95%E5%85%BB%E6%88%90%E9%A6%96%E5%8F%91%E8%99%8E%E5%97%85/\" target=\"_blank\" rel=\"noopener\">全球最大的问答网站之一，Stack Exchange如何养成</a>》)这个趋势，但他们却漠视了这样的一个事实，顶尖技术人才往往都更倾向于在创新型的发展中企业工作以便将来获得百万美元级别的股票在手，而不想在一个臃肿行动缓慢的大企业中谋取一份肥缺(注意：有些在华尔街的大企业其实也会开出异常引诱人的条件，但这毕竟只是异数了)。这就导致了恐龙将输掉这场人才争夺战，从而会丢掉创新这一个更大的战场。然后，兄弟…就再也没有然后了。</li>\n<li><strong>恐龙们不知道互联网市场已经变得如此的生死攸关</strong>。同时他们也不清楚在线平台在俘获和留住用户方面是如何的重要，因此也不会清楚这对维持今后的营业毛利和利润是多么的重要。这第3点或许是一个最微妙的情况，因为恐龙的用户慢慢的从线下转向线上的这种现象其实并不是非常容易让人察觉的事情。所以，和上面提到的第2点原因一样，俘获和留住顶尖的市场人才也是充满硝烟的。大部分恐龙其实都对他们其实应该在争夺“助推企业赠长的技术人才“这场赛跑中需要拿出冲刺的速度这个事实没有任何概念。</li>\n</ol>\n<p>上面所有的原因最终回归到一个最根本的观点就是：<strong>大部分恐龙上市企业从不把任务关键性(mission-critical)的软件技术和互联网市场已经成为商业重要竞争力的这个事实放在心上</strong>。因此，一个初创的独角兽很容易就将这些缺少互联网基因的极度脆弱的恐龙变作午餐了。</p>\n<p>简单点来说：恐龙上市公司的市盈率平均在15-20的范畴意味着我们的“市场先生”认为其中的某个恐龙X将会有着15-20年的流动资金和利润来维持生存。<strong>除非这个推测非常他妈的混账 - 独角兽将在10年内就将恐龙X给踢出局。</strong></p>\n<p>现在你也许会这样对自己说：天啊，这些恐龙还能依靠原来的给养维持15-20年这么长久啊，那么这么长时间内市场的自我调控不就能起作用做自我调整了吗。很明显，这些互联网白痴(编者注：原文用的就是白痴-Moron这个词，并非编者特意添油加醋。)对资本和经济究竟如何运作是一无所知的。如果以上这些说法成立的话，那么我们的“市场先生”的市场调控机制就会开始运作，那些被“高估”的恐龙的股值和相关的市值就应该慢慢的自动往下调了…对吧？</p>\n<p>鉴于我自己本身是一个规规矩矩的风险投资家以及是个宅男级别的经济学者，所以我更倾向于我们的“市场先生”会一如既往的找到一个平衡点。但除了这里有一个小问题：你不可能在很长的一段时间里对一个公共市场进行沽空，至少在长达5到10年的时间里是肯定不可能的。世上并没有一个行之有效的进行沽空或者对冲/衍生出来工具来捕捉到独角兽什么时候会开始衰落从而走向瓦解，故此我们唯一的选择只能是相信当前对这些独角兽企业的估值(也许过高了)数据。</p>\n<p>这就正正是我们的“市场先生”现在所在做的事情，也正正是那些独角兽企业看起来估值过高的原因，同时也正是为什么所有的<strong>恐龙都将走向死亡</strong>的原因了。</p>\n<hr>\n<p><strong>版权</strong>:本作品采用[<a href=\"http://creativecommons.org/licenses/by/3.0/cn/\" target=\"_blank\" rel=\"noopener\">创作共用署名3.0中国大陆版许可证</a>], 若非授权，转发时切勿删除以下联系信息，否则追究相应责任。本文首发本人iDoNews专栏。</p>\n<p><strong>提醒</strong>:更多相关文章将请关注微信公众号:<strong>techgogogo</strong>或官网<a href=\"http://techgogogo.com/\" target=\"_blank\" rel=\"noopener\">www.techgogogo.com</a>。</p>\n","categories":[{"name":"创业","path":"api/categories/创业.json"}],"tags":[]}