{"title":"独角兽有泡沫？Absolutely！但绝非估值泡沫","slug":"独角兽于估值泡沫","date":"2015-04-23T11:53:41.000Z","updated":"2017-07-17T04:31:27.000Z","comments":true,"path":"api/articles/独角兽于估值泡沫.json","excerpt":null,"covers":["http://abovethecrowd.com/wp-content/uploads/2015/02/zen.jpeg"],"content":"<p><a href=\"http://abovethecrowd.com/wp-content/uploads/2015/02/zen.jpeg\" target=\"_blank\" rel=\"noopener\"><img src=\"http://abovethecrowd.com/wp-content/uploads/2015/02/zen.jpeg\" alt=\"zen\"></a></p>\n<p>&nbsp;</p>\n<blockquote>\n<p>编 者注: 原作者Bill Gurley，作为美国最著名的投资人之一，Benchmark 的合伙人，他的公司参与投资过Uber、SnapChat、DropBox、WeWork等多个创业公司。在当今专家们对“独角兽”是否估值过高争论的面 红耳赤之际，以独特的角度提出了他的<a href=\"http://abovethecrowd.com/2015/02/25/investors-beware/\" target=\"_blank\" rel=\"noopener\">看法</a>，认为确实存在泡沫，但不是估值泡沫，而是“风险”泡沫…<br>在 一个成功的科技公司中，融资将会贯穿其整个生命周期。通常会始于种子期，然后迈进A,B,C轮和“晚期”融资，然后，对于那些非常成功的企业来说，应该就 是开始 IPO(首次公开募股)了。纵观整个投资界的历史进程，传统来说，不同的金融机构会专注于不同阶段的投资，因为不同阶段所需要的风险评估技术和机会评估技 术都是不一样的 - 比如，一个种子期投资金融机构就不大可能会进行晚期(late-stage)投资，反之亦然。</p>\n</blockquote>\n<p>在最近几年里，晚期投资 市场已经成为了以上提及的众多投资过程中竞争最激烈，人员最密集的投资阶段。世界各地的投资者都认为晚期投资是它们最想玩转的地方。结果就是，晚期融资不 再是仅仅为那些高估值，预期可赢利的公司准备IPO前而准备的了，它演变成仅仅代表一轮阵容庞大的高金额的融资活动而已。在最近几年就出现过史无前例的 80多家私有企业在所谓晚期融资阶段募集了超过10亿美元的资金。这些阵容庞大的，高金额的非上市企业融资现象就是这个特别的科技公司融资过程(演变后的 晚期融资)的一个特性。</p>\n<p>很多人争论说，如果摆在早几年的话，投资人对这些公司进行如此争先恐后且巨额的投资，那么这些公司应该早就上市了， 应该是IPO才会如此的吧。事实上并非如此，这些都是在IPO前发生的事情。事实上，这些企业家和投资者这样做，其实也是将自身放在一个非常危险的位置。 这些公司中只有很少一部分是真的有做好了上市准备、满足了上市的条件的。这种在IPO前就进行的巨额的私募资金的形式跟IPO其实是有着非常大的区别的。 搞清楚这些区别其实对我们去真正了解这种已经变质的巨额晚期私募资金所带来的危害是至关重要的。</p>\n<p>充满讽刺意味的是，刚刚过去的的2014年却是IPO的最高纪录的一年。所以很多这些获得了巨额投资而其实还没有准备好上市的私有企业却上市了，其实这真的是没有任何的好处。这些企业的估值也许跟上市企业的估值相似，但事实上这也就是它们唯一的一个相似之处而已。</p>\n<p>他 们之间其实是大相径庭的，首要的一个不同的地方就是这些进行晚期募资的私有企业根本就没有经过高强度的审查。而高强度的审查恰恰就是IPO必经的一个流 程。你要知道IPO是需要走一个非常严格的流程的，这代表了一个企业在其生命周期中需要走过的最彻底的一个流程。这就是为什么那些上市企业以及它们的股东 在此流程中会感觉痛不欲生的原因了 - 无论他们是已经准备好上市，还是他们在根本没有准备好就进行上市。审计员，银行家，各种律师，期间你还别忘记了证 券交易委员会将会花上几个月的时间来对你的企业进行调查以保证你提供的每一项数据都是精准无误的，重要的风险都必须被确定下来，账目都必须是已经精算完 毕，企业的发展管理必须健康发展。相反，晚期私募就没有这种声势和流程，这些募资的完成可能就仅仅因为一个演示用的PPT而已。</p>\n<p>缺乏了审计 员的深度、严格而又紧凑的审计核算，投资商们就会以为他们在私募活动中看到的的数字和企业上市前经过严格紧凑核算的商业财务信息一样的准确。事实上，很多 这些私有企业的这种财务审核却是拖拖拉拉的消耗上年的时间的，就算提交核算结果的时间临近了，这种情况下的审核员也不会像真正的IPO一样真的卷起袖子开 始竭尽所能进行审核的。因为在IPO过程中，他们提供的这些数据是会被证券交易委员会认真审核的，而在私募过程中却没有这种规定。举个简单的例子，很多投 资商和企业家其实并没有意识到联票和折现率其实是不应该算在“营业收入确认”中的，你必须在你的总营收中减去这一部分。而事实上，现在很多“有钱途”的私 有消费型企业却普遍运用着这种市场战略，所以他们的财务演示中事实上存在着很多这种不合理的账目。</p>\n<p>缺乏了银行家的指引，一些公司在呈现他们 的财务状况时也许就会偏离行业标准。作为另外一个例子，我们看看现在的一些提供买卖市场的企业，比如ebay和GrubHub，人家的财务收益报告都是基 于净收入而非总收入的。而反观那些初创企业，它们提供的更多是关注于总收入这个数据，而大家要知道的是，这些总营收中的80%其实都是需要付给商品供应商 的。一个好的银行家很轻易就能在正常的IPO流程中将这个问题给指出来 - 作为一个投资商，你应该是根据净收入进行投资，而不是比净收入高处好几倍的收 入总额。</p>\n<p>将数以千万美元计的资金砸入一个还不成熟的私有企业同时也会给企业的运作原则本身带来适得其反的效果，这些还不成熟的私有企业一旦 获得如此巨额的投资，它们对资金运用的结果又是如何的呢？事实证明唯一的结果就是导致营业亏损！我们看看过往的历史就知道了，一个真正将要到达IPO级别 的企业，投资商都会看中该企业的收益能力。而反观这些还不成熟的私有企业，当它们拿到如此大笔的资金后，它们却会因缺乏紧迫性而将需要去证明的盈利能力和 市场模式这些目标进行缓慢的推进。</p>\n<p>我们就拿Fab.com这个公司来分析吧，在“商业内幕(Business Insider)”今年2月6号的一篇文章中，Allyson Shontell发现该公司在获得4800万美元的募资4个月之后，公司成立人和 CEO却向企业员工披露说“我们已经成功的花费掉2000万美元，遗憾的是，我们还是未能证明我们的商业模式是否确实可行。”</p>\n<p>去克服这些风 险，责任人应该在投资人这一方。投资人应该进行更深入的研究，将潜在的商业中的所有经济因素都进行仔细的考察。这就要求投资人必须认认真真的分析该商业中 的真实的边际收益，而非只是简单的去考察营收总额和净收益以及其他不切实际的收益衡量方式，甚至不应只是去看该企业给出来的毛利。如果你真的想要知道该商 业模式是否真的值得你去角逐，你必须要非常的小心谨慎。否则，你最终其实可能只是找到了一个将1美元当0.85美元来卖的公司而已(编者注：也就是说投资 商投资的是一个不值钱的企业)。</p>\n<p>最后，对私有企业进行投资相比对上市企业进行投资来说还存在一些结构性的问题。很多私有企业的融资过程都会 涉及到清算优先权的优先股。这种拥有清算优先权的优先股给予了投资人一个拥有退出权下行保护(downside protection)的条款。当你的企业以这种形式进行了多次募资之后，根据该企业对之前的优先股进行清理的程度，企业的估值将会有很大的区别，从而会 影响后续的投资人的投资。随着这些优先股越积越多(优先股在不同轮的优先级也会不一样)，后来新增的投资人就会担心他们真金白银买回来的份额是否真的值这 个价钱，从而，他们往往就会要求企业开出一些特殊的条款来保障他们的权益，但具有讽刺意味的是，这些保障条款又会进一步对比他们后进来的投资人非常的不友 善，且这也会对让这个公司真实的市值表变得越加错综复杂。</p>\n<p>最终，为了不让该公司的市值表变得脆弱的不堪一击，该私有企业也就不得不在还没有 完全准备好的时候就匆匆上市。一旦上市，所有的优先股都将会变成普通股(编者注：这里原作者只是针对美国的情况)，以便让所有清算优先权等条款导致的问题 就会烟消云散了。其实最近的Box.com所以IPO的情况就是这方面的一个真实的写照了。这里显而易见的一个非常具有讽刺意味的情况就是，其实大部分这 些企业都是不愿意将IPO作为自己的最后一根救命稻草的。但不幸的是，正因为他们没有尊崇走向IPO的正常的步骤，所以最终他们不得不去尝试抓住最后的这 根稻草以期望得到救赎了。</p>\n<p>所有这些都表明我们面临的其实不是一个估值泡沫 - 而这恰恰是现在很多主流媒体所认同的观点。我们事实上现在是处于一个“冒险泡沫(Risk Bubble)”中(编者注：我们的投资人无视太多的风险而在“晚期”这一轮融资中盲目的投入了过多的资金，误将晚期当IPO造成的泡沫)。同时因为以上 的这些财务等问题的存在，企业在拿到这些投资之后又必须烧掉巨额的金钱去弥补这些财务问题，这就会进一步危害到这些企业的长远发展。</p>\n<p>“晚 期”投资人，因为他们极度害怕自己会丢失掉拥有一个将来成为“独角兽”的企业的股份的机会，所以他们将本来应该坚持的传统正规的风险分析抛至九霄云外。这 些传统的本应是“早期”进行投资的投资商，投资机构，以及坐拥千百万的个人，他们都在争先恐后的往这个高风险的“晚期”融资游戏进行冲刺。</p>\n<p>我们这时也许应该冷静的思考下Warren Buffer的一个建议了，“每一个市场中肯定都存在着一个傻瓜，如果你环视四周还是找不到谁是这个傻瓜的话，那么，很可能你自己就是了！”。</p>\n<p>&nbsp;</p>\n<hr>\n<p><strong>提醒</strong>:更多文章请关注公众号:<strong>techgogogo</strong>或官网<a href=\"http://techgogogo.com/\" target=\"_blank\" rel=\"noopener\">www.techgogogo.com</a>。当然，也非常欢迎您直接微信(<strong>zhubaitian1</strong>)勾搭。</p>\n<p><strong>版权</strong>:本作品采用[<a href=\"http://creativecommons.org/licenses/by/3.0/cn/\" target=\"_blank\" rel=\"noopener\">创作共用署名3.0中国大陆版许可证</a>], 若非授权，转发时切勿删除联系信息，否则追究相应责任。</p>\n","categories":[{"name":"创业","path":"api/categories/创业.json"}],"tags":[]}