{"title":"小心“破坏性创新”成为自己的掘墓人","slug":"破坏性创新","date":"2015-05-19T01:36:22.000Z","updated":"2017-07-17T04:28:17.000Z","comments":true,"path":"api/articles/破坏性创新.json","excerpt":null,"covers":null,"content":"<blockquote>\n<p>编者注：本文来自网站<a href=\"http://www.algoworks.com/blog/disruptive-technologies\" target=\"_blank\" rel=\"noopener\">algoworks</a>，中文版由天地会珠海分舵编译。面对破坏性技术，我么要眼观六路耳听八方！我们要不断的“把玩”新技术，但注意别让技术把自己给把玩了…<br>夏天来临之际，除了天气变得越来越酷热之外，技术界也变得越来越沸腾。业界争论的最沸沸扬扬的而又常常被误解的术语“破坏性技术”就是其中之一。如果读者还从未听过这个术语的话，那么你还应该知道“破坏”这个词曾经还被认为是一个范式转移的情况。<br>互动百科：所谓“范式转移”，是指一个领域里出现新的学术成果，打破了原有的假设或者法则，从而迫使人们对本学科的很多其本理论做出根本性的修正。例如，当人们发现地球是圆的而不是平的后，之前对地球上所发生的各种现象的理解全部都要重新考虑。这样，之前旧的范式（地平说）被一个新的范式（地圆说）所代替。从根本上来说，范式转移就是冲出原有的束缚和限制，为人们的思想和行动开创了新的可能性。<br>现在随处可见到人们在讨论着说某某技术将会如何的成为破坏性技术、将如何的改变游戏规则、以及将如何的让人们的生活变得更好。而今天我们要探讨的是“破坏性技术”所带来的冲击的另一面。</p>\n</blockquote>\n<h1 id=\"定义\"><a href=\"#定义\" class=\"headerlink\" title=\"定义\"></a>定义</h1><hr>\n<p>所谓破坏性创新指的就是一种技术创新，一种产品或者服务的创新。这种创新将会颠覆市场中原来占统治地位的技术或者产品。</p>\n<p>更精确的来说，这可以理解成，破坏性创新就是一种将原有市场进行破坏的创新。破坏性创新往往会以市场所始料不及的方式带来大幅度改进的产品和服务，典型的方式有大幅提升的收益，急剧下降的成本，变革性的业务流程的改进或者将市场所面向的用户的需求甚至用户进行一次全新的定义。</p>\n<p>大部分企业认为“破坏”意味着一个随着新的技术浪潮而产生的高度精炼的、高端的产品。来自哈佛的Clayton Christensen在其引领商界创新领域潮流的书《创新者的困局》中常常反复提及，那些既得利益的行业巨头往往对破坏性技术却不怎么感冒，因为他们更倾向于蜗居在原有的自己熟悉的技术领域当中，同时也对在现有客户群中获取不高的利润没有太大的意见。 Clayton Christensen的理论同时也提出了一点，这些破坏性技术的发展速度往往会超过用户的需求增长速度。</p>\n<h1 id=\"前车之鉴\"><a href=\"#前车之鉴\" class=\"headerlink\" title=\"前车之鉴\"></a>前车之鉴</h1><hr>\n<p>很多人其实并不清楚百视达、诺基亚、柯达这些没落的巨头有什么共同点。它们的共同点其实就是它们都是破坏性创新的受害者。</p>\n<p>通过近来对破坏性创新这个课题的深入研究，我了解到这么两点：</p>\n<ul>\n<li>首先，破坏性创新是一个当前非常火爆的研究课题。</li>\n<li>其次，事实上已经存在大量的非常强大的且并不需要大伤筋骨的可行的方法，来让企业们考虑用来避免自己重蹈那些上一年还存在今天却已经被破坏性创新给踢出局的企业的覆辙。<br>当这些行业巨头没有成功的交付出/拥抱破坏性创新的时候，这些市场的旧主导者就会很快失去市场的青睐。柯达因没有成功拥抱数码相机而失败，报纸行业之前因博客平台的破坏而大幅裁员，这些都是非常明显的前车之鉴了。<blockquote>\n<p>“一个真正的破坏性技术不但会改变人类的思考方式，还会改变大家的行为方式”</p>\n</blockquote>\n</li>\n</ul>\n<h1 id=\"破坏性创新所带来的破坏\"><a href=\"#破坏性创新所带来的破坏\" class=\"headerlink\" title=\"破坏性创新所带来的破坏\"></a>破坏性创新所带来的破坏</h1><hr>\n<p>我们应该相信破坏性创新会改变已有的游戏规则。真正的破坏性进程必然会带来彻底的思想变革和创新，而单纯的在已有基础上进行更新，增加，增强或者修改的话都不能算是破坏性创新。</p>\n<p>下面就是近几年发生的破坏性创新所带来的颠覆性破坏的示例:</p>\n<ul>\n<li>可下载的音乐/MP3/iPod: 随着这种可下载的音乐媒体的出现，我们之前的爱华、索尼等Walkman也早就销声匿迹了，当然，也还有一些公司依然在苟延残喘甚至转行的。</li>\n<li>数码相机 ：数码相机的出现，让大家可以更简单的进行拍照，可以拍下更多照片，可以捕捉下更多漂亮的镜头。这对于原来的菲林式的相机企业是非常具有破坏性的，它让柯达等巨头走向没落之余还让一大批在原来行业中的佼佼者失去了工作。</li>\n<li>电子邮件和数字化：随着简便的电子邮件和信息数字化这种破坏性技术的出现，原来的邮寄信件行业就完全被颠覆了，从而产生深远影响的还有造纸业和墨水制造业。</li>\n<li>社交媒体：随着Facebook，Google+，Tumblr，LinkedIn和Twitter等社交媒体的出现，电信业就进入到一个非常困难的时期。现在人们基本上都很少通过必须有SIM卡的短信或电话进行沟通了，我们会选择使用很多其他的如Skype，Viber，Whatsapp以及其他一大堆的不同应用来完成这项任务。人们发现这些社交媒体非常的实用，除了满足短信和电话服务之外，还能够让自己在上面显示自己的当前状态和有针对性的和特定的人群进行通话，并获取到朋友的最新状态等。这些社交媒体正在把我们的世界变得越来越小。</li>\n<li>电子报纸和电子新闻：我们现在都习惯于在我们的电子设备上查看新闻，而非每天跑到街边报纸的摊档去挑选一份只有一小部分内容是自己感兴趣的报纸。</li>\n<li>流媒体服务：比如流媒体公司讯飞(Netfix)现在在美国已经成为最大的视频订阅提供商，同时讯飞也被认为是传统视频订阅大鳄百视达的掘墓人。</li>\n<li>电子书和电子杂志: 这里最明显的应该就算亚马逊的Kindle给传统的书籍和杂志行业所带来的破坏了。</li>\n<li>移动支付：尼尔森市场调查公司在2014年1月份曾经公布说，全世界54%的人，北美71%的人，都倾向于用信用卡而非现金来进行支付。而现今，无数的更新的支付方式正在将传统的现金支付方式给逐步变成历史。比如我们现在逐渐倾向于网上支付甚至直接进行网上购物。</li>\n<li>自行付费结帐的零售系统：根据劳工统计局的统计，自动结账系统的出现在2013年就导致美国几十万的收银员丢失了工作。当一些岗位被自动化起来后，这种情况是在所难免的了。当然，也还有不少人是选择跟收银员进行交易，而非面对冰冷的机器的。况且，这种零售系统还要面对窃贼这个很大的风险。</li>\n</ul>\n<h1 id=\"面对破坏性技术我们该作何反应？\"><a href=\"#面对破坏性技术我们该作何反应？\" class=\"headerlink\" title=\"面对破坏性技术我们该作何反应？\"></a>面对破坏性技术我们该作何反应？</h1><hr>\n<p>我们每个人都有可能要面对破坏性技术的冲击。我们需要保持警觉并时刻准备好与这种破坏性的技术改变所带来的威胁作斗争。在我的整个研究和学习过程中，我发现那些没有对破坏性技术的到来做出正确的反应以致坍塌的企业主要是因为两个原因：不是反应过慢就是过于冥顽不灵。</p>\n<p>比如以下这些公司就是因为没有迅速对破坏性技术采取应对措施而走向没落的：Honeywell(霍尼韦尔), Kodak(柯达), Lucent(朗讯), Polaroid(宝丽来), Nortel(北电), Compaq(康柏), Gateway(捷威), Control Data(数据控制公司), Borland(宝兰), Nokia(诺基亚),等等</p>\n<p>当一个破坏性技术出现在你所处产业的实现之中时，你就需要好好的考虑下以下几个问题了。</p>\n<ul>\n<li>作为一个公司的领导人，你将是否有足够开放的思想来拥抱这些新的技术的到来。</li>\n<li>贵公司的整个高管团队又是怎样的一种观念？你们是否又有足够的意愿去聆听破坏性技术所带来的异响呢？</li>\n<li>企业家们应该好好分反省自己，究竟自己的领导能力是否真的适合带领整个公司去迎接破坏性技术的到来。<br>眼观六路耳听八方！我们要不断的“把玩”新技术，但注意别让技术把自己给把玩了。</li>\n</ul>\n<p>我最后给出的建议是：与其在现有的基础上高筑篱墙以防破坏性技术将自己扫地出门，不如放开胸襟拥抱新技术让自己成为下一个破坏性创新的一员！</p>\n<p><em>本文首发本人iDoNews专栏。</em></p>\n<hr>\n<p><strong>提醒</strong>:更多文章请关注公众号:<strong>techgogogo</strong>。当然，也非常欢迎您直接微信(<strong>zhubaitian1</strong>)勾搭。<br><strong>版权</strong>:本作品采用[<a href=\"http://creativecommons.org/licenses/by/3.0/cn/\" target=\"_blank\" rel=\"noopener\">创作共用署名3.0中国大陆版许可证</a>], 若非授权，转发时切勿删除联系信息，否则追究相应责任。</p>\n","categories":[{"name":"产品","path":"api/categories/产品.json"},{"name":"创业","path":"api/categories/创业.json"},{"name":"创新","path":"api/categories/创新.json"}],"tags":[]}