{"title":"天欲亡我，非战之罪！怪吾创业前未阅《三国》矣！","slug":"组织债务","date":"2015-05-21T10:54:36.000Z","updated":"2017-07-17T04:25:22.000Z","comments":true,"path":"api/articles/组织债务.json","excerpt":null,"covers":null,"content":"<p>编者注：本文来自创新创新大师Steve Blank的<a href=\"http://steveblank.com/2015/05/19/organizational-debt-is-like-technical-debt-but-worse/\" target=\"_blank\" rel=\"noopener\">博客</a>，提到技术债务，其对产品的危害可谓广为人知。但是提到这个崭新的组织债务，可能就无人知晓了。而这对初创企业来说往往却是比技术债务还要致命的，下面请看创新大师Steve Blank是如何通过理论结合实践来对我们的创始人们进行耳提面命的…</p>\n<h1 id=\"技术债务-vs-组织债务\"><a href=\"#技术债务-vs-组织债务\" class=\"headerlink\" title=\"技术债务 vs. 组织债务\"></a>技术债务 vs. 组织债务</h1><hr>\n<p>初创企业每天都在为寻找自己的产品/市场匹配(Product/Market fit)而烧钱，所以他们非常关注产品的开发速度，这无可厚非。但，俗语有云：欲速则不达。如果一味盲目的追求产品开发和获取早期客户的速度，而忽略了代码/硬件的编码/构建质量的话，到时往往会事与愿违。虽然表面看来产品是出来了，但是支撑产品的代码/硬件可能却会变得非常的难以扩展和维护。这种为了速度而作出的牺牲随着时间慢慢日增月累，就成为了我们常说的“技术债务”了。就算我们的公司短期内看上去是获得了成功，但产品里面的技术债务却也是积少成多，隐患也就随之而倍增，到时可能就会积重难返，非冒大风险、动大手术不可了。</p>\n<p>所以我们做产品开发的时候经常会通过重构的手段来解决技术债务所带来的问题，虽然整个重构并不会带来任何额外的功能，但是却让我们的代码更加稳定和易读，从而也就让我们的代码更容易扩展和维护了。</p>\n<p>以上所描述的技术债务其实很好理解，因为这方面的讨论随处可见。但是看官们有所不知的是，除了所谓的技术债务这个风险，初创公司成长的过程中其实还隐藏着另外一个可能带来更大危害的“债务”。且这个债务非常致命，可以瞬间将你的公司置之死地。这，就是我们今天主要讨论的主角 - “组织债务(Organizational Debt)”。简而言之，组织债务指的就是在初创企业早期，公司组织为了快速将公司做起来而做出的所有折衷的选择。</p>\n<p>你每天呕心沥血、通宵达旦、煞费苦心的为你的公司和产品付出，期望企业就会一马平川快速迈进的攻城略地(占领市场)，孰料全神贯注与敌人厮杀之际，“组织债务”这个长有反骨的家伙却祸起萧墙搞了个窝里反，将你的大本营(企业)瞬间变成比七国还乱的梦魇！最终你只能仰天长叹：“天欲亡我，非战之罪也！怪吾创业前未阅三国矣！”</p>\n<p>所以一个正在发展中的初创企业要对“组织债务”这个祸根有深刻的认知，要知道如何像通过重构代码来处理”技术债务“一样，通过“重构”你的组织来处理好你的”组织债务“。处理技术债务是为了让你的产品代码更加易于维护和更具有可扩展性，类比，处理组织债务就是为了让你的企业组织更加稳定且易于维护和具有可扩展性。举个例子，这就好比一个代码中的bug可能会导致你的产品退货如潮，一个企业中的”魏延“带来的风险可能会是全员倒戈(这里先抛开历史存在争论的诸葛亮杀魏延是否有充分的证据不谈)。</p>\n<p>&nbsp;</p>\n<h1 id=\"公司CEO-Tom的问题\"><a href=\"#公司CEO-Tom的问题\" class=\"headerlink\" title=\"公司CEO Tom的问题\"></a>公司CEO Tom的问题</h1><hr>\n<p>话说上周我曾经和Tom一起中午用膳，Tom乃某一初创公司之CEO，该初创公司发展迅猛，大有成为一大企业之势头 - 其于上年收益总额为400万美元，今年将至800万乃至1000万，其收入主要源自广告费用。该公司针对传统印刷媒体于网站及移动设备上做了个重新发明，因新生代读者皆倾向于在线阅读而非购买实体杂志。该媒体之内容主题鲜明，目标读者明确，且每天及时更新。</p>\n<p>当Tom谈及下一轮融资时公司将被估值5亿美元时兴奋不已。他高谈阔论其将会如此这般地维持公司之指数级增长势头，以及将会如何为公司招兵买马，同时也谈及企业快速扩展及尾随而至的众多问题。(该公司于上年将兵力从100增加至200，且如今欲将再增兵200)。当Tom不断将话题关注于其公司所将获得的高额估值时，本人却极力欲将话题扭转至该公司将应如何应对快速增长所碰到之问题种种，如:</p>\n<ul>\n<li>如何从公司文化及工作职能上着手建立高效可行的新人培训制度 ？</li>\n<li>同时又将如何稳住众多能征善战的老军之军心，毕竟老兵们一直跟公司出生入死却只拿着新兵的军饷和股权。<br>而Tom却一如既往继续自然自语该如何为其公司选择一块新的风水宝地，该购置何种高档家私，当然，还谈及该如何计划对跟随自身出生入死的关键大将们提供稿酬。注意，只谈及关键大将而已。</li>\n</ul>\n<p>而这，却让我感觉情况不妙。</p>\n<p>&nbsp;</p>\n<h1 id=\"一个菲律宾VC的观点\"><a href=\"#一个菲律宾VC的观点\" class=\"headerlink\" title=\"一个菲律宾VC的观点\"></a>一个菲律宾VC的观点</h1><hr>\n<p>当时一个来自菲律宾的VC也在场，我们礼节性的进行应酬。我和他一起喝了杯咖啡然后问他对公司的扩张所碰到的挑战有何高见。当我听到以下这些听起来感觉非常VC(风投)的专业化术语回答之后咂舌不已：</p>\n<blockquote>\n<p>“这可是个平台，不是个单纯的产品“<br>甚至还来个更时髦点的回答：<br>”这可是个潜在的“独角兽“哦。“<br>这些回答看上去其实更像是个长期计划的战略目标，所以我进一步刺探该VC说:”(既然需要大幅招兵)那么你们将如何对这些新员工进行入职培训呢？你们对现今处于公司工薪水平底层的那一班老员工又准备作何处置和考虑呢？你们又考虑过你们此举可能会让公司这几年耗费巨大资源培养起来却一直拿着底薪的老将们辞职不干吗？我得到竟然是如Tom的风格般的回答：<br>我们会对公司高层发放新股权(对了,Tom和他的合伙人将会在下一轮融资时出售一定的股权)，提供优美的办公环境，要不我再跟你重申下我们的雄图伟愿和战略？<br>该菲律宾VC继续喋喋不休的重申着他们的雄图伟愿和战略，我却已经听者无心了。因为我开始意识到，对，他确实在发现和孵化初级阶段的初创企业上面可以算得上才华横溢，同时他也给公司赋予了一个不错的愿景来吸引下一轮的新投资进来。但，问题是他并不知道该如何对一个公司进行扩张。他从来就没有真正运作过一家成功的企业，更甚者，他从未有过协助一个初创企业从最初的寻求商业模式和产品/市场匹配，到下一阶段企业逐渐成熟，需要进行基础设施“搭建”以便公司更好的进行扩张的经验。</p>\n</blockquote>\n<p>除非他们现在颠覆将要对公司采取的举措，否则组织债务将会以难以置信的速度快速的给他们带来意想不到的冲击。事实上，他们此时更应该好好计划下该如何“重构”他们的组织债务，而Tom是不可能从董事会中得到任何这方面的解决方案的。</p>\n<p>&nbsp;</p>\n<h1 id=\"组织债务如期而至\"><a href=\"#组织债务如期而至\" class=\"headerlink\" title=\"组织债务如期而至\"></a>组织债务如期而至</h1><hr>\n<p>虽然，如上所述，公司对高层人才有着不错的安排计划，且有着所有其他初创企业都会提供的其他福利，比如免费食物，甚至允许员工把宠物带来上班，但，他们对从最初的100号为公司的创立鞠躬尽瘁的员工做到现在几百号人所积压起来的组织债务所投入的思考的时间却是少得可怜的。而这100号创始员工都是有着专业的知识以及久经锤炼的工作技巧的。在公司创立初期，他们都是因为想在一个将会颠覆老媒体行业的新媒体公司工作而被吸引过来的，且他们知道创业维艰，都是拿着低薪和很小的股权来为公司效力的。而当他们一直在低头默默为公司做贡献的时候，你一个新一轮的融资以及随之而来的用高薪大量的招兵买马，这不是逼迫唏嘘的他们含着泪水去LinkedIn更新尘封已久的简历吗？</p>\n<p>具有讽刺意味的是，当新一轮的大量招兵买马的浪潮来临的时候，你之前因为公司早期还太小而建立的那一套入职培训制度却不再适用。随着几百号新兵涌入，公司开始拼命的找人想建立一套更新的行之有效的入职培训制度来将这些新兵给培养起来：首先要让他们融入到公司的文化里面，其次需要有一个正式的流程来培训他们获得相应的工作技能。但很不幸，那些可以担此重任的人恰恰就是那批一直拿着底薪而现在正在更新着简历准备复员的老兵们。</p>\n<p>这时，预示着组织债务就如期而至了！</p>\n<p>&nbsp;</p>\n<h1 id=\"如何重构组织债务\"><a href=\"#如何重构组织债务\" class=\"headerlink\" title=\"如何重构组织债务\"></a><strong>如何重构组织债务</strong></h1><hr>\n<p>当时我答应了Tom几天后会一起出来喝杯咖啡，帮他解决这些问题。几天后我们如约而至。我首先问了他对HR部门老大的看法，他的回答是觉得HR老大做的很不错啊，有帮忙为我们公司员工提供医保社保，协助进行公司股票投资，自动的为大家处理报销单，组织大家晚上看电影，搞了不少的野营活动等来进行团队建设。我告诉他，这些如果放在一个早期的初创企业来说，HR的确算是做的很不错。但是，今时不同往日了，你现在已经是到了基础设施打造的阶段了，现在是时候更上一层楼了(HR如果不能跟上步伐，只能把他抛到楼下了)。因为Tom自己是工程师出身的，所以当我用“技术债务”这个比喻来跟他解析“组织债务”的时候，他很快就能领会了。他立刻就追问”那么我该如何重构这个组织债务呢？“</p>\n<p>我给了他下面这7个建议 - 其中一些需要雷厉风行立刻执行的，一些却是需要时间步步为营的艰难推进的：</p>\n<ol>\n<li>建立一个简单可行的计划来管理好下一次招聘潮。对每一位招聘主管进行以下的三令五申：</li>\n</ol>\n<ul>\n<li>如果你们自己都没有到需要去LinkedIn更新简历的程度的话，别想着去招聘增加人手。</li>\n<li>如果真到这个程度的话请别再用之前还是创业初期的那份招聘简介，请更新一份和我们现在公司阶段相吻合的。</li>\n<li>请描述清楚你将会如何对这些新兵进行培训以让他们快速投入对应的功能岗位。</li>\n<li>描述清楚如何考核这些新兵究竟应该处于公司的哪个级别，把从这个职位开始往上的各个升迁级别和标准列出来，同时也要把这个职位开始往下的各个降级级别和标准给定下来。</li>\n<li>最后把新兵在其当前所处的职位上对上和对下应该如何完成他们的任务的描述整理出来。</li>\n</ul>\n<ol>\n<li>同时我也注意到Tom对“重构“组织债务所准备的投入是远远不够的。我给他的做法定义为劫贫济富 - 是在劫取一直拿着底薪的老员工的工资来给新员工付高薪。这样做只能让公司的关键员工心灰意冷而导致人才流失。他应该停止只是对关键员工进行10%加薪以求安抚人心的做法，而应该考虑，如果招聘一个新员工去替换掉这个拥有关键技术的老员工的话需要多少的付出，在我看来，他应该要在原来基础上再加薪50%才能持平。所以他现在应该做的应该是这样要求HR的老大:</li>\n</ol>\n<ul>\n<li>对现有老员工的薪资做深入的调查，同时也在同行中进行深入这方面的调查。</li>\n<li>找出公司想要留下来的关键老员工。</li>\n<li>立刻给他们加薪和增加股权。<br>以下几个建议执行起来有一定的难度，因为他关系到整个组织整体的变动：</li>\n</ul>\n<ol>\n<li>Tom需要考虑对原来招进来的一部分员工以及他们的角色进行“重构”。这一部分员工可能并不能跟上公司发展的步伐，不能跟上公司从原来创业初期还只是关心如何找到产品/市场匹配到现在具备一定的规模需要进行基础设施“打造”的扩张步伐，又或者是这一部分员工根本不适合在一个更大的企业进行工作，又或者是这一部分员工一直存在态度问题。这些员工也许是创业初期通过朋友关系进来的。如果现在将绩效低下的他们依然留在关键位置的话，那么对新员工的绩效评估就很难有公平可言。这个“重构”将是很艰难的一个过程，必须要好好计划应该如何推进。</li>\n<li>除了需要对人进行重构之外，我们也是时候看下公司文化的重构了。初创公司早期的文化价值观到了现在羽翼丰满且人员大规模增加的时候是否依然还适用呢？试想下，支持我们能做到今天这个高额估值的关键因数究竟有哪些呢？它们是否都是同一回事？又或者大相径庭呢？这些关键因数又是如何支持着我们？为什么能支撑着我们呢？也许现在是时候考虑下这个公司究竟代表着什么了。</li>\n<li>既然现在公司已经发展到一定的程度，公司的规模也开始扩大，我们不再是一个围着个会议室圆桌或者在咖啡厅来进行打游击式办公的散兵游勇了。我们需要一个公司文化来宣扬我们的公司，来伴随我们的公司一起成长。有时候，这个公司文化的固话需要三申五令，因为一开始，就算CEO自己也会忽略掉自己的公司文化是什么的。一个初创公司从开创初期到一旦日趋成熟，那么就需要进行基础设施打造，而这个打造过程是一个公司快速转变的过程。在这个剧变的过程中一再强调公司的文化和口号是让我们不至于迷失方向和维稳的很重要的一个方法。</li>\n<li>那么跟客户沟通的方式是否也需要进行重构呢？在创业初期，所有的客户都可能会直接跟Tom这个CEO进行交互，那么到了今时今日，你就要考虑，这是否还是可行的？这是否是你所期望的？</li>\n<li>最后，因为这对Tom和他的董事会来说都是个新事物，所以如果能找到一些之前曾经有经历过上面所说的“打造”这个从创业初期到公司快速增长的阶段的人，来请他们建立一个顾问委员会，这就最好不过了。<br>&nbsp;</li>\n</ol>\n<h1 id=\"教训\"><a href=\"#教训\" class=\"headerlink\" title=\"教训\"></a>教训</h1><hr>\n<p>以下就是通过Tom这个案例我们应该学到的关于组织债务的相关教训：</p>\n<ul>\n<li><p>一个初创公司能从初创走到快速增长需要基础设施打造的阶段是非常幸运的，但这里面会存在一些新的挑战：</p>\n<ul>\n<li>切记该阶段碰到的挑战不仅仅是战略上的。</li>\n<li>这还包含去对公司长期积累下来的”组织债务“进行重构的挑战。</li>\n</ul>\n</li>\n<li><p>入职，培训，文化，以及对老员工的回报，所有这些在”打造“阶段碰到的问题都需要用一个全新的角度和方式来进行对待。</p>\n</li>\n<li>如果不能成功的对组织债务进行重构，那么所带来的打击可能将会是致命的。<br>&nbsp;</li>\n</ul>\n<hr>\n<p><strong>提醒</strong>:更多文章请关注公众号:<strong>techgogogo</strong>或官网<a href=\"http://techgogogo.com/\" target=\"_blank\" rel=\"noopener\">www.techgogogo.com</a>。当然，也非常欢迎您直接微信(<strong>zhubaitian1</strong>)勾搭。</p>\n<p><strong>版权</strong>:本作品采用[<a href=\"http://creativecommons.org/licenses/by/3.0/cn/\" target=\"_blank\" rel=\"noopener\">创作共用署名3.0中国大陆版许可证</a>], 欢迎转载，但转发时请保留公众号信息，否则追究相应责任</p>\n","categories":[{"name":"产品","path":"api/categories/产品.json"},{"name":"创业","path":"api/categories/创业.json"}],"tags":[]}