{"title":"初创企业：融资有风险 额度需谨慎","slug":"融资有风险-额度需谨慎","date":"2015-04-18T10:57:02.000Z","updated":"2017-07-17T04:38:18.000Z","comments":true,"path":"api/articles/融资有风险-额度需谨慎.json","excerpt":null,"covers":["http://johngreathouse.com/wp-content/uploads/2015/03/image0012.jpg"],"content":"<p><a href=\"http://johngreathouse.com/wp-content/uploads/2015/03/image0012.jpg\" target=\"_blank\" rel=\"noopener\"><img src=\"http://johngreathouse.com/wp-content/uploads/2015/03/image0012.jpg\" alt=\"image001\"></a></p>\n<blockquote>\n<p>编者注：每个初创企业都想一口吃成个独角兽，但在你成为独角兽之前，你应该好好考虑你现在这个还没成型的身躯是否能撑得下一个独角兽的食量，在融资的时候可别把自己肚皮撑破了或者消化不了把自己撑死在出师未捷身先死的征途上，下面我们看看著名企业家John Greathouse是怎么<a href=\"http://johngreathouse.com/dont-let-your-startup-o-d-on-cash/\" target=\"_blank\" rel=\"noopener\">看待这个问题</a>的…</p>\n</blockquote>\n<h1 id=\"融资有风险，额度需谨慎\"><a href=\"#融资有风险，额度需谨慎\" class=\"headerlink\" title=\"融资有风险，额度需谨慎\"></a>融资有风险，额度需谨慎</h1><p>有时候钱还真的不是越多越好，特别是对你的初创企业来说，有时如果太早的进行了过多的募资，结果可能反而会将你的企业推向深渊。因为你在这个时期募资过多，可能会驱使你把钱乱花在一些还没有证明着实可行的商业模式上面，或在一些雇员的真实天分还没有被真正激发/发掘出来并能够长期与公司共进退的时候就乱往他们头上砸钱，最终甚至会导致和投资人/业主/其他第三方关系人进行撕逼。</p>\n<p>所以在这个阶段，为了避免为你的初创企业过早的敲响丧钟，我建议你无论你现在银行或者余额宝上有多少的存款，你都尽量在花每一毛钱之前好好想想这一分钱花得值不值得，同时你很应该在你的企业中培养出一种节俭的文化出来。</p>\n<p>“这听上去太抠门太违反常理了吧？”也许你会这样说。而事实上，初创企业其实也很难做到只在有明确的可衡量的收益回报的情况下做出正确的财务投入。</p>\n<p>但你听听人家世界首富比尔盖茨是怎么个说法的：</p>\n<blockquote>\n<p>“不像我们周边的其他竞争对手那样到处买灰机乱花钱，我们花出去的每一分钱都基本上会给我们公司带来收益”<br>人家微软在多年前已经飞黄腾达富得流油了，但人家的高管们(包括我们的比尔盖茨先生)依然节俭如故。人家并不是说付不起入住豪华酒店这个钱，只是人家比尔和他的公司觉得将公司的钱花在能给公司带来效益的地方比去花钱让一班高管到处去游玩获得暂时性的快乐来的实际。</p>\n</blockquote>\n<p>你需要让你的团队成员清楚的知道公司如果把钱花在任何一个不能带来成效的东西身上其实对员工他们自己也会带来重大的影响的。因为，在公司创建初期，你现在每花出去一分钱，今后你就需要融资回来相应的一分钱进行填补，最后融资回来的钱就会把你们雇员自己的股份给稀释掉。而在公司融资的晚期(编者注：作者指得应该是C轮等还没有真正IPO的这个时期)，你浪费的每一分钱都会减少公司的现金流，从而直接影响公司的估值，也就是影响你雇员自身的股票价值！</p>\n<p>&nbsp;</p>\n<h1 id=\"飞机坠于没油，企业垮于无钱\"><a href=\"#飞机坠于没油，企业垮于无钱\" class=\"headerlink\" title=\"飞机坠于没油，企业垮于无钱\"></a><strong>飞机坠于没油，企业垮于无钱</strong></h1><p>事实证明，私人飞机坠毁的大部分情况下是因为飞机没油了，而不是其他技术性的问题。大多数情况下这都是因为飞行员错误的预算到达目的地所需要的机油数量。也许按照正常的情况下你是觉得这么多油已经足够了，但是你没有考虑到其他一些情况会将你的机油额外的消耗掉，比如风向阻力，速度，载物重量，人员数量等等。这些错误得估算都会最终导致机毁人亡，剩下一个在晚上面对着新闻频道哭得伤心欲绝呼天抢地我见犹怜的破碎家庭。</p>\n<p>对初创公司来说，现金流就是你公司这架飞机的机油。你如果没有足够的金钱的话你是不可能带领你的企业达到目的地的。而你在你的产品还不能吸引大量的投资之前，你只能用你银行账号里有限的金钱来支撑你企业的前行，这就好比你要开飞机穿越一个广袤的中间没有加油站的沙漠一样，请确保你别在还没穿过沙漠就把油消耗光以致出师未捷身先死，尸骸遍野撒满地，家里妇孺无所依的情况。</p>\n<p>所以你承受不起这种大开油门，绕道前行，期间还要觉得无聊降落下来买个贵得吓死人的立体声以娱乐自己的飞行方式。如果中间有个加油站(新投资进来之类)的话，那我只能说恭喜你，算你走运。在理想状态下，你应该是在产品已经出来了需要进一步扩张和成长的情况下才会/能去引进资金，而不是在你的公司产品模型都没有出来，还在生死线上挣扎的时候就想找投资人给你支付宝打钱。</p>\n<p>当初Expercity(后来被Citrix收购了)作为一个初创企业还没有任何收益的情况下，我们有一次在前期估值可以募集800万大洋的情况下，最终只接受了300万美元进来。在我们完成这一轮的融资的时候，我非常清楚得记得和其中一个非常资深的工程师的一次谈话，他当时竟然非常吃惊我们当时没有考虑接受更多得投资进来以便花个几十万去泰晤士广场打个广告。</p>\n<p>他的论点是，“这没有什么风险吧？如果广告没有起效的话，权当打了水漂，重新再找投资人投钱呗。” 大家要相信这个故事并不是杜撰得，这些话语是确确实实得从一个非常聪明的人得嘴里说出来的。这个荒谬的建议让我觉得非常的羞愧，感觉我非常的对不起Expercity公司，因为我之前没有好好的为公司打造出一个节俭的文化，竟然导致有员工提出这样的让我震惊的视投资人的钱如粪土的问题出来！</p>\n<p>&nbsp;</p>\n<h1 id=\"繁荣建立在“抠门”之上\"><a href=\"#繁荣建立在“抠门”之上\" class=\"headerlink\" title=\"繁荣建立在“抠门”之上\"></a>繁荣建立在“抠门”之上</h1><hr>\n<p>以下简单的(且公认非常浅显的)策略将会带来真正的节俭并帮助你确保你的公司员工在花每一分公司的钱的时候都感觉是在花他们自己的钱一样的小心谨慎。</p>\n<p><strong>建立节俭文化</strong>：在员工的心里种植下一个节俭光荣的思想，鼓励大家在每一个应该花钱的地方都进行讨价还价，每次掏钱打的或者住旅馆等之前都问一句“能再便宜点不？” 同时在公司建立一个论坛，表彰那些真正去将节俭当成公司文化并进行亲身实践的员工。这种方法会让你建立起一种节俭的公司文化，并让员工在花公司每一分钱的时候都像是花他们自己的钱一样的谨慎。</p>\n<p><strong>设立一个讲价专员</strong>：在你的财务部们中设立一个专门对高额采购进行讨价还价的讲价专员的职位。在Expertcity中，我将自己的这种节俭经验传授给了我们的那个讲价专员。并规定他在每笔交易中只要为公司节省1美元他就有20分入袋作为他的季度奖赏。后来当他把他的讲价技巧磨练的驾轻就熟之后，公司中所有其他人员一旦有重大交易的时候都会请他去进行砍价。</p>\n<p><strong>拥抱二手货</strong>：尽管事实上我们账目有300万美元的流动基金，但在Expertcity中，我曾经因为Larry经常去倒闭的同行中低价收购我们需要的设备而授予他“清算家Larry”的称号。Expertcity坐落在一个孵化器大环境中，周边有大量的创业公司，所以经常会由公司倒闭。当我们一旦发觉他们后院起火的时候，我们就会在需要的时候低价接手他们的设备，甚至他们的办公场所。</p>\n<p>有些情况下，我们甚至可以免费获得这些倒闭的公司的设备，前提是帮他们付清他们的租约，但你要知道这比起一次公平交易更让人欣慰，因为这种做法会帮助这些失败的企业成员付清他们个人财务难以担当的几年的租约债务，这种好人好事，何乐而不为呢？</p>\n<p><strong>功利主义按需而行</strong>：虽然我们要尽量避免把钱浪费在奢华的办公空间和家私上面，但是在一些必须的场合我们还是需要落足本钱的。例如在一些客户来访接待啊，前台啊这些地方。</p>\n<p>&nbsp;</p>\n<h1 id=\"勿把创业当摇滚\"><a href=\"#勿把创业当摇滚\" class=\"headerlink\" title=\"勿把创业当摇滚\"></a>勿把创业当摇滚</h1><hr>\n<p>&nbsp;</p>\n<p>英国的摇滚巨星Freddie Mercury曾经说过：</p>\n<blockquote>\n<p>无论什么，总是越大越好。<br>Freddie的这种说法在摇滚界也许是成立的，但是放在创业界的话，这种说法就错得不能再错了。</p>\n</blockquote>\n<p>一个公司不会没有钱花，只会没有投资者投钱进来给它花。你应该避免把投资人给你投钱的这个友谊给花费掉，保证他们投进来的每一分钱都花在了清晰的可以衡量的刀刃上，无论他们给你的支付宝打进了多少钱！</p>\n<hr>\n<p><strong>提醒</strong>:更多相关文章将请关注微信公众号:<strong>techgogogo</strong>或官网<a href=\"http://techgogogo.com/about/\" target=\"_blank\" rel=\"noopener\">www.techgogogo.com</a>，当然，也非常欢迎您直接微信(<strong>zhubaitian1</strong>)舵主我进行互动了。<br><strong>版权</strong>:本作品采用[<a href=\"http://creativecommons.org/licenses/by/3.0/cn/\" target=\"_blank\" rel=\"noopener\">创作共用署名3.0中国大陆版许可证</a>], 若非授权，转发时切勿删除以下联系信息，否则追究相应责任</p>\n","categories":[{"name":"创业","path":"api/categories/创业.json"}],"tags":[]}